{
    "assets_744c3ef6243d76429a95f010a3d47cff": "Assets Management",
    "assets_b0278ad267d2461d3eeafc96122e4a31": "Phalcon\\\\Assets is a component that allows the developer to manage static resources such as css stylesheets or javascript libraries in a web application.",
    "assets_4c79a3fe144f02b4051810553a60c81d": ":doc:`Phalcon\\\\Assets\\\\Manager <..\/api\/Phalcon_Assets_Manager>` is available in the services container, so you can add resources from any part of the application where the container is available.",
    "assets_647e8a84d61a2443e8d863a01727bdb8": "Adding Resources",
    "assets_fab89985217fa01f7d36db4a2aae5611": "Assets supports two built-in resources: css and javascripts. You can create other resources if you need. The assets manager internally stores two default collections of resources one for javascript and another for css.",
    "assets_adae69cdf99e915a88e999a00581ded7": "You can easily add resources to these collections like follows:",
    "assets_97b60f20c393002ceb1986abec9f384b": "Add some local CSS resources",
    "assets_541ee5ffa36c80f2738a6aac8cf5fbb5": "and some local javascript resources",
    "assets_9d066fce3103272821fc1c8a5c911fb0": "Then in the views added resources can be printed:",
    "assets_40aa86d406a1567e2bb210cfccefd275": "Local\/Remote resources",
    "assets_467802b99de71cf3cdd123387595c997": "Local resources are those who're provided by the same application and they're located in the document root of the application. URLs in local resources are generated by the 'url' service, usually :doc:`Phalcon\\\\Mvc\\\\Url <..\/api\/Phalcon_Mvc_Url>`.",
    "assets_3f915d0e3e0a36ea435f995608b6919b": "Remote resources are those such as common library like jquery, bootstrap, etc. that are provided by a CDN.",
    "assets_749e2c3df0bf62ddd51bf3b50e61a2c4": "netdna.bootstrapcdn.com\/twitter-bootstrap\/2.3.1\/css\/bootstrap-combined.min.css', false)",
    "assets_ad9b4b4c5b5164f6d3d77012df79c45f": "Collections",
    "assets_b0af0daf04f160e1588b0acba893eb88": "Collections groups resources of the same type, the assets manager implicitly creates two collections: css and js. You can create additional collections to group specific resources for ease of placing those resources in the views:",
    "assets_8a454675029935590059e4a4207f2252": "Javascripts in the header",
    "assets_b51c560c9b848906d21798a4e9124a11": "Javascripts in the footer",
    "assets_4ce74cf3cd3f9c87190cc9cdcdd697de": "Then in the views:",
    "assets_f051468092cd30c784f47c1c1f518b5e": "Prefixes",
    "assets_68847db02bfef9a3f2cbb88f3bb52ebc": "Collections can be URL-prefixed, this allows to easily change from a server to other at any moment:",
    "assets_ddc247728a472f8b6e91d02848f12326": "cdn.example.com\/');",
    "assets_2dd20ca96e294ccca7d0b0498988674e": "A chainable syntax is available too:",
    "assets_5aa494e28988749ce9c0590848cf362e": "cdn.example.com\/')",
    "assets_ae62cffd270c3e0cab6f30fefed9136c": "Minification\/Filtering",
    "assets_5d6201f6b3994c20409263f5f58ea822": "Phalcon\\\\Assets provides built-in minification of Javascript and CSS resources. The developer can create a collection of resources instructing the Assets Manager which ones must be filtered and which ones must be​ left as they are. In addition to the above, Jsmin by Douglas Crockford is part of the core extension offering minification of javascript files for maximum performance. In the CSS land, CSSMin by Ryan Day is also available to minify CSS files:",
    "assets_13288958d7900905c0705e80f54a8091": "The following example shows how to minify a collection of resources:",
    "assets_24d37315fe2dd7cc09472c27e3f5f7f8": "These Javascripts are located in the page's bottom",
    "assets_569bb9f943f3f450a88d429c86ce78a2": "The name of the final output",
    "assets_26d8454d754918be398e0b9fdbeb5ae0": "The script tag is generated with this URI",
    "assets_506859d439edc456b63250e6d21506ba": "This is a remote resource that does not need filtering",
    "assets_8483fe8dbc76cbc7cd4c561a9fb8e9d4": "These are local resources that must be filtered",
    "assets_bb21e08f5118d8e756e5931ad34a0cb4": "Join all the resources in a single file",
    "assets_e7e2222b6c8fc52259a40f333221fd7c": "Use the built-in Jsmin filter",
    "assets_846d0f7848b284338b9f8cf2925e60ef": "Use a custom filter",
    "assets_da38d11ae4639174732c3a3a7b3c539a": "It starts getting a collection of resources from the assets manager, a collection can contain javascript or css resources but not both. Some resources may be remote, that is, they're obtained by HTTP from a remote source for further filtering. It is recommended to convert the external resources to local eliminating the overhead of obtaining them.",
    "assets_86e4862e10edfdeada3c6627782eb1a1": "As seen above, method addJs is used to add resources to the collection, the second parameter indicates whether the resource is external or not and the third parameter indicates whether the resource should be filtered or left as is:",
    "assets_018bbed3aeeec02df927ee3f6c36fe33": "This a remote resource that does not need filtering",
    "assets_117e99e366d35d81ada7c3bf77dfcab1": "Filters are registered in the collection, multiple filters are allowed, content in resources are filtered in the same order as filters were registered:",
    "assets_68e1c7c7c02b0c92d429361a93e217b4": "Note that both built-in and custom filters can be transparently applied to collections. Last step is decide if all the resources in the collection must be joined in a single file or serve each of them individually. To tell the collection that all resources must be joined you can use the method 'join':",
    "assets_a9e35114d8dbc115f304b3e8ec0db44f": "The name of the final file path",
    "assets_de1e687c95ee8b073172990876438f26": "The script html tag is generated with this URI",
    "assets_a4bc709eadced84a672028c6471bad63": "If resources are going to be joined, we need also to define which file will be used to store the resources and which uri will be used to show it. These settings are set up with setTargetPath() and setTargetUri().",
    "assets_4e6bcce78953fc4fab8ab028f9630b0e": "Built-In Filters",
    "assets_b71d0d7b82df795a3f71bc36986017d6": "Phalcon provides 2 built-in filters to minify both javascript and css respectively, their C-backend provide the minimum overhead to perform this task:",
    "assets_d1b2812923f7a6a1b2e2d1c556d842ce": "Custom Filters",
    "assets_29d376fce56b9b142527b0a8f433e827": "In addition to built-in filters, a developer can create his own filters. These can take advantage of existing and more advanced tools like YUI_, Sass_, Closure_, etc.:",
    "assets_5f64b35b08613f5d7f879a85b64466db": "Write the string contents into a temporal file",
    "assets_03bdedb550012cb6cd20dab6d7eb4edd": "Return the contents of file",
    "assets_cd6b467ef5d856d72fe964ed65ffd28a": "Usage:",
    "assets_c0ce9fe3866c4f3e96453e2d0c1cc01d": "Get some CSS collection",
    "assets_4a9cea3c8c1c8fc27161b32c96823eba": "Add\/Enable the YUI compressor filter in the collection",
    "assets_5360cfefe9d89ff1c2f947439de199a3": "Custom Output",
    "assets_6a556a51195344c6d4e6f145ea73b690": "Methods outputJs and outputCss are available to generate the necessary HTML code according to each type of resources. You can override this method or print the resources manually in the following way:"
}