{
    "loader_c8f48d17ec17f73c71701dbefa922bbe": "Universal Class Loader",
    "loader_e9efafebf4cb67840a64a80aff0daf0c": ":doc:`Phalcon\\\\Loader <..\/api\/Phalcon_Loader>` is a component that allows you to load project classes automatically, based on some predefined rules. Since this component is written in C, it provides the lowest overhead in reading and interpreting external PHP files.",
    "loader_e4c6f8515974b8349488fe3d89d75280": "The behavior of this component is based on the PHP's capability of `autoloading classes`_. If a class that does not exist is used in any part of the code, a special handler will try to load it. :doc:`Phalcon\\\\Loader <..\/api\/Phalcon_Loader>` serves as the special handler for this operation. By loading classes on a need to load basis, the overall performance is increased since the only file reads that occur are for the files needed. This technique is called `lazy initialization`_.",
    "loader_6e14a95cb826e28080486414b346a683": "With this component you can load files from other projects or vendors, this autoloader is `PSR-0 <https:\/\/github.com\/php-fig\/fig-standards\/blob\/master\/accepted\/PSR-0.md>`_ compliant.",
    "loader_334d1d8c943955240927884d0cd43b58": ":doc:`Phalcon\\\\Loader <..\/api\/Phalcon_Loader>` offers four options to autoload classes. You can use them one at a time or combine them.",
    "loader_f0d1ea6f8ecdc3c9be68760b4db0bb54": "Registering Namespaces",
    "loader_e1df98f6943b181da25c4f0cd238e04c": "If you're organizing your code using namespaces, or external libraries do so, the registerNamespaces() provides the autoloading mechanism. It takes an associative array, which keys are namespace prefixes and their values are directories where the classes are located in. The namespace separator will be replaced by the directory separator when the loader try to find the classes. Remember always to add a trailing slash at the end of the paths.",
    "loader_4b4ba81e5d13f4105da1c536c17e790e": "Creates the autoloader",
    "loader_b365b3098f8bada9ada29235f6405308": "Register some namespaces",
    "loader_974a6d2fc8d2eda86afedcbe99ba9670": "register autoloader",
    "loader_4d55139683b97606adab8b179f54f916": "The required class will automatically include the",
    "loader_e90d8097da0b4e429f30d55a2d335eff": "file vendor\/example\/adapter\/Some.php",
    "loader_9fc168b6855cd7b997409068c74c496a": "Registering Prefixes",
    "loader_bf8461fb6eccab1951e194ec636657d3": "This strategy is similar to the namespaces strategy. It takes an associative array, which keys are prefixes and their values are directories where the classes are located in. The namespace separator and the \"_\" underscore character will be replaced by the directory separator when the loader try to find the classes. Remember always to add a trailing slash at the end of the paths.",
    "loader_80d81894c6ec279f72c8925ed3b552a8": "Register some prefixes",
    "loader_f9a1bb9e4166386c8996631599b15b81": "Registering Directories",
    "loader_d6e445d6d41140c51fb599b42816e741": "The third option is to register directories, in which classes could be found. This option is not recommended in terms of performance, since Phalcon will need to perform a significant number of file stats on each folder, looking for the file with the same name as the class. It's important to register the directories in relevance order. Remember always add a trailing slash at the end of the paths.",
    "loader_2ca87035b51a0efda122b88cce1f8d6a": "Register some directories",
    "loader_d530bf9509e078b10e089a8336c504e7": "The required class will automatically include the file from",
    "loader_02f3bb1b6cbd25185a722f86d5c645c6": "the first directory where it has been located",
    "loader_e642de17f8ef58b01d672536783d18a5": "i.e. library\/OtherComponent\/Other\/Some.php",
    "loader_3fb81c3fa5af1fb24fa95ce3a29a1546": "Registering Classes",
    "loader_ffa6e96687b518bb06e47a1dbba4c2e8": "The last option is to register the class name and its path. This autoloader can be very useful when the folder convention of the project does not allow for easy retrieval of the file using the path and the class name. This is the fastest method of autoloading. However the more your application grows, the more classes\/files need to be added to this autoloader, which will effectively make maintenance of the class list very cumbersome and it is not recommended.",
    "loader_d44269b3d8851f6b1e0fccf6afa06506": "Register some classes",
    "loader_19b41511f55c0eda2a991fcf351d377b": "Requiring a class will automatically include the file it references",
    "loader_d142b7f8a10d00c5f0ca4482e7a181eb": "in the associative array",
    "loader_681e56350f1db61e293841bb6d7b4c06": "Additional file extensions",
    "loader_5973661d6bf969480e9ce6961b9ef4e2": "Some autoloading strategies such as  \"prefixes\", \"namespaces\" or \"directories\" automatically append the \"php\" extension at the end of the checked file. If you are using additional extensions you could set it with the method \"setExtensions\". Files are checked in the order as it were defined:",
    "loader_9f6cb2e9ce681cf0eaf7326cc9978301": "Set file extensions to check",
    "loader_9bb8905b56939f589ab60a39a3f7cad3": "Modifying current strategies",
    "loader_69b2ab1eaa9b57f73f1c7f307e98c253": "Additional auto-loading data can be added to existing values in the following way:",
    "loader_36353d5e937e32a21b483c820274d1d6": "Adding more directories",
    "loader_d90de01f4d9134715969c2aa6bae6174": "Passing \"true\" as second parameter will merge the current values with new ones in any strategy.",
    "loader_d946d4fc503cdc77e799865f0f0ec045": "Security Layer",
    "loader_01ac6473cbf5b4105e52ec38365236bc": "Phalcon\\\\Loader offers a security layer sanitizing by default class names avoiding possible inclusion of unauthorized files. Consider the following example:",
    "loader_9f09a50d5ff20f231536e64a5470f34a": "Basic autoloader",
    "loader_e13269138f9f39bec8a393a4055d5c07": "The above auto-loader lacks of any security check, if by mistake in a function that launch the auto-loader, a malicious prepared string is used as parameter this would allow to execute any file accessible by the application:",
    "loader_5394a579ea762ea2fbc3743172498043": "This variable is not filtered and comes from an insecure source",
    "loader_bff05a46e9a8ac0538aa324add0c506d": "Check if the class exists triggering the auto-loader",
    "loader_1724c47e8b4eab6cf91921fe9df7ea59": "If '..\/processes\/important-process.php' is a valid file, an external user could execute the file without authorization.",
    "loader_45fd426d2bb6952a4b325897f7a59b40": "To avoid these or most sophisticated attacks, Phalcon\\\\Loader removes any invalid character from the class name reducing the possibility of being attacked.",
    "loader_b6386395fed27ad94fc2fc7a570fe221": "Autoloading Events",
    "loader_ec0aafc547f07550a41c144843c6af14": "In the following example, the EventsManager is working with the class loader, allowing us to obtain debugging information regarding the flow of operation:",
    "loader_300862db2c4124e3da5ab44ceb465f6b": "Listen all the loader events",
    "loader_b35fc09e5f2a9209956905e3f7a9f1e0": "Some events when returning boolean false could stop the active operation. The following events are supported:",
    "loader_f07747c719e154f6ba1384e010ddc59e": "Troubleshooting",
    "loader_1a3657a13f35fe1e1963850259869e36": "Some things to keep in mind when using the universal autoloader:",
    "loader_bbe24be5c2cdda53e9de9551de186ff0": "* Auto-loading process is case-sensitive, the class will be loaded as it is written in the code * Strategies based on namespaces\/prefixes are faster than the directories strategy * If a cache bytecode like APC_ is installed this will used to retrieve the requested file (an implicit caching of the file is performed)"
}