{
    "migrations_e9344089a64801b2141c890b330a0fcb": "Database Migrations",
    "migrations_f301d41b7379bf73aa2ec3a13c5aa6e0": "Migrations are a convenient way for you to alter your database in a structured and organized manner.",
    "migrations_6d0774cca265eac9c4f7900155a19c10": "Often in development we need to update changes in production environments. Some of these changes could be database modifications like new fields, new tables, removing indexes, etc.",
    "migrations_86a4e169a1f5e1c962715ed06af30e3b": "When a migration is generated a set of classes are created to describe how your database is structured at that moment. These classes can be used to synchronize the schema structure on remote databases setting your database ready to work with the new changes that your application implements. Migrations describe these transformations using plain PHP.",
    "migrations_c2c6a196f47f93f72deb7b1bdb09136d": "Schema Dumping",
    "migrations_8be6a9683bb5d5b5bf2c2c4bac56783f": "The :doc:`Phalcon Developer Tools <tools>` provides scripts to manage migrations (generation, running and rollback).",
    "migrations_203535c85e7bb7824da0d937e8ab2fe0": "The available options for generating migrations are:",
    "migrations_360af274a46cce617945ea23ff912b4b": "Running this script without any parameters will simply dump every object (tables and views) from your database in migration classes.",
    "migrations_b726638947cbfbefc87e275c663b82a1": "Each migration has a version identifier associated to it. The version number allows us to identify if the migration is newer or older than the current 'version' of our database. Versions also inform Phalcon of the running order when executing a migration.",
    "migrations_6d7decd5070994a0afa0d63acb389aca": "When a migration is generated, instructions are displayed on the console to describe the different steps of the migration and the execution time of those statements. At the end, a migration version is generated.",
    "migrations_28e728f8b1f2d65ed3c758a61286d6d9": "By default :doc:`Phalcon Developer Tools <tools>` use the *app\/migrations* directory to dump the migration files. You can change the location by setting one of the parameters on the generation script. Each table in the database has its respective class generated in a separated file under a directory referring its version:",
    "migrations_b673cb7a0ed9fb88408b3bb89ae3c1ef": "Migration Class Anatomy",
    "migrations_1dd1afd8dc05142d04a6cb584c4be3f3": "Each file contains a unique class that extends the Phalcon\\\\Mvc\\\\Model\\\\Migration These classes normally have two methods: up() and down(). Up() performs the migration, while down() rolls it back.",
    "migrations_cbe6b57bfb055245ecb16ec1e3e6fd23": "Up() also contains the *magic* method morphTable(). The magic comes when it recognizes the changes needed to synchronize the actual table in the database to the description given.",
    "migrations_5d8072dc56e4dcc8255178194d5001c1": "The class is called \"ProductsMigration_100\". Suffix 100 refers to the version 1.0.0. morphTable() receives an associative array with 4 possible sections:",
    "migrations_fdc42990e3b6f6fbdfa0c2091c3dd1b0": "Defining Columns",
    "migrations_d5dd06884d15100629a1a7efa90e4366": ":doc:`Phalcon\\\\Db\\\\Column <..\/api\/Phalcon_Db_Column>` is used to define table columns. It encapsulates a wide variety of column related features. Its constructor receives as first parameter the column name and an array describing the column. The following options are available when describing columns:",
    "migrations_693f023ec4e718b7c0a6c9a231892599": "Database migrations support the following database column types:",
    "migrations_47d26717150280ad3585faf14f7904aa": "* Phalcon\\\\Db\\\\Column::TYPE_INTEGER * Phalcon\\\\Db\\\\Column::TYPE_DATE * Phalcon\\\\Db\\\\Column::TYPE_VARCHAR * Phalcon\\\\Db\\\\Column::TYPE_DECIMAL * Phalcon\\\\Db\\\\Column::TYPE_DATETIME * Phalcon\\\\Db\\\\Column::TYPE_CHAR * Phalcon\\\\Db\\\\Column::TYPE_TEXT",
    "migrations_98592e9224abec7b6a4957b5f4b035b4": "Defining Indexes",
    "migrations_aeb3e98001a3a150150cefe12302d896": ":doc:`Phalcon\\\\Db\\\\Index <..\/api\/Phalcon_Db_Index>` defines table indexes. An index only requires that you define a name for it and a list of its columns. Note that if any index has the name PRIMARY, Phalcon will create a primary key index in that table.",
    "migrations_18f0b0ff59a37b6adc6b8a16e4430559": "Defining References",
    "migrations_1f2b29d16db162f94052bbfd388e6954": ":doc:`Phalcon\\\\Db\\\\Reference <..\/api\/Phalcon_Db_Reference>` defines table references (also called foreign keys). The following options can be used to define a reference:",
    "migrations_3288ae777aa932ca0f6a2a90da292c6d": "Writing Migrations",
    "migrations_bcfc0fca08f7f3bfb030bbba1fad022c": "Migrations aren't only designed to \"morph\" table. A migration is just a regular PHP class so you're not limited to these functions. For example after adding a column you could write code to set the value of that column for existing records. For more details and examples of individual methods, check the :doc:`database component <db>`.",
    "migrations_d7452f33e484571303e4cc4ab5b15ffe": "Running Migrations",
    "migrations_063f176fa57cf226a7d0a5d3b84c0935": "Once the generated migrations are uploaded on the target server, you can easily run them as shown in the following example:",
    "migrations_1c64e9a2a899094ccdcad4688e8b3b3d": "Depending on how outdated is the database with respect to migrations, Phalcon may run multiple migration versions in the same migration process. If you specify a target version, Phalcon will run the required migrations until it reaches the specified version."
}