{
    "motivation_2cf7c3b0f6f192ab0ca9a6c5e3f6be54": "Our motivation",
    "motivation_31aa4f0f4306fd7924f89b407792a90c": "There are many PHP frameworks nowadays, but none of them is like Phalcon (Really, trust us on this one).",
    "motivation_f7e0a4b2b71788f6b30215f0ac8f861a": "Almost all programmers prefer to use a framework. This is primarily because it provides a lot of functionality that is already tested and ready to use, therefore keeping code DRY (Don't Repeat Yourself). However, the framework itself demands a lot of file inclusions and hundreds of lines of code to be interpreted and executed on each request from the actual application. Object-Oriented frameworks also add a lot of overhead to execution making complex application slow. All these operations slows the application down and subsequently impacts the end user experience.",
    "motivation_6363257aaa03bef325c3de40b385f535": "The Question",
    "motivation_66a38207d3e6995d23d285160259e14e": "Why can't we have a robust framework with all of its advantages but with none or very few disadvantages?",
    "motivation_0c3ed55f2ca0d223f619d59be08cfb12": "This is why Phalcon was born!",
    "motivation_755ad80bdc55e333c6ada6bdeaca1d25": "During the last few months, we have extensively researched PHP's behavior, investigating areas for significant optimizations (big or small). Through this understanding, we managed to remove unnecessary validations, compacted code, performed optimizations and generated low-level solutions so as to achieve maximum performance from Phalcon.",
    "motivation_4d438f231d6424ee70922e09c2df9724": "Why?",
    "motivation_81b84087e3240e4b69f483d32f1d3b25": "* The use of frameworks has become mandatory in professional development with PHP * Frameworks offer a structured philosophy to easily maintain projects writing less code and making work more fun * We love PHP and we think it can be used to create larger and more ambitious projects",
    "motivation_0a5bf8b427d2ab7bd54e898c9bf7f01d": "Inner workings of PHP?",
    "motivation_57a708bbdecbc5cc484dccdfb6b0c37b": "* PHP has dynamic and weak variable types. Every time a binary operation is made (ex. 2 + \"2\"), PHP checks the operand types to perform potential conversions * PHP is interpreted and not compiled. The major disadvantage is performance loss * Every time a script is requested it must be first interpreted * If a bytecode cache (like APC) isn't used, syntax checking is performed every time for every file in the request",
    "motivation_aac322c48602e8d313a212b30222a680": "How do traditional PHP frameworks work?",
    "motivation_a5379a5d4ea680c118b432c103dd96ce": "* Many files with classes and functions are read on every request made. Disk reading is expensive in terms of performance, especially when the file structure includes deep folders * Modern frameworks use lazy loading (autoload) to increase performance (for load and execute only the code needed) * Some of these classes contain methods that aren't used in every request but they're loaded always consuming memory * Continuous loading or interpreting is expensive and impacts performance * The framework code does not change very often, and yet an application needs to load and interpret it every time a request is made",
    "motivation_79a660da7ec1997a23748a330d479e3a": "How does a PHP C-extension work?",
    "motivation_0722fa9a556e9e86ba3721983b0f8c00": "* C extensions are loaded together with PHP one time on the web server's daemon start process * Classes and functions provided by the extension are ready to use for any application * The code isn't interpreted because is already compiled to a specific platform and processor",
    "motivation_0e6f1eda7c3cf86b124eb0e9e1650229": "How does Phalcon work?",
    "motivation_a40a6d1b1014418aa94e1560f9648fe1": "* Components are loosely coupled. With Phalcon, nothing is imposed on you: you're free to use the full framework, or just some parts of it as a glue components. * Low-level optimizations provides the lowest overhead for MVC-based applications * Interact with databases with maximum performance by using a C-language ORM for PHP * Phalcon directly accesses internal PHP structures optimizing execution in that way as well",
    "motivation_1ae79d4ac325ff0f13fc776875753ce8": "Why do I need Phalcon?",
    "motivation_22ecb0f80aa084024995252186d8f8aa": "Each application requirements and tasks are different than another's. Some for instance are designed to do a set of tasks and generate content that rarely changes. These applications can be created with any programming language or framework. Using a front-end cache usually makes such an application, no matter how poorly designed or slow it might be, perform very fast.",
    "motivation_dfefc40824bf8a32ed3b45bc2c406852": "Other applications generate content almost immediately that changes from request to request. In this case, PHP is used to address all requests and generate the content. These applications can be APIs, discussion forums with high traffic loads, blogs with a high number of comments and contributors, statistic applications, admin dashboards, enterprise resource planners (ERP), business-intelligence software dealing with real time data and more.",
    "motivation_56a14b97b95cb74da861ebd6f81d6d46": "An application will be as slow as its slowest component\/process. Phalcon offers a very fast yet feature rich framework that allows developers to concentrate on making their applications\/code faster. Following proper coding processes, Phalcon can deliver a lot more functionality\/requests with less memory consumption and processing cycles."
}