{
    "mvc_fb51bf6fae14a2ebff47eac849ee61c5": "The MVC Architecture",
    "mvc_d8571cb594a03fd7c6de0f33dcc56318": "Phalcon offers the object-oriented classes, necessary to implement the Model, View, Controller architecture (often referred to as MVC_) in your application. This design pattern is widely used by other web frameworks and desktop applications.",
    "mvc_ab4eaca614bb9a4a5b676917c9924aeb": "MVC benefits include:",
    "mvc_404751daf4568ded4652ea4415b770d6": "* Isolation of business logic from the user interface and the database layer * Making it clear where different types of code belong for easier maintenance",
    "mvc_8762dff10e7e0030292723f2be7af463": "If you decide to use MVC, every request to your application resources will be managed by the MVC_ architecture. Phalcon classes are written in C language, offering a high performance approach of this pattern in a PHP based application.",
    "mvc_927b1c3f8d9b894ec7be4c9139fd1501": "Models",
    "mvc_740eecca4eaf8027cc318a76084871fd": "A model represents the information (data) of the application and the rules to manipulate that data. Models are primarily used for managing the rules of interaction with a corresponding database table. In most cases, each table in your database will correspond to one model in your application. The bulk of your application's business logic will be concentrated in the models. :doc:`Learn more <models>`",
    "mvc_6dd3305031fd2571d16b707ed91ccb13": "Views",
    "mvc_83184bfa7c999fa67c2deb6a6fd29869": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application. :doc:`Learn more <views>`",
    "mvc_50f1458a9054f560cf1f8a37014e7aa6": "Controllers",
    "mvc_6dd7586e22b50745e01d428f140fc9b6": "The controllers provide the \"flow\" between models and views. Controllers are responsible for processing the incoming requests from the web browser, interrogating the models for data, and passing that data on to the views for presentation. :doc:`Learn more <controllers>`"
}