{
    "queue_6332f1db13668447736410ecc6fbfa07": "Queueing",
    "queue_4effefab7e75769f5442bf260b5babd8": "Perform activities like process a video, resize images or send emails aren't suitable to be executed online or in real time because it may slow the loading time of pages, impacting the user experience.",
    "queue_505fd6da56ac07ad21003663bf14dc05": "The best solution here is implementing background jobs. A web application must put the job into a queue and wait that it will be processed.",
    "queue_b344a7c6d42394ffa5dcbd6360c9fe46": "While you can find more sophisticated PHP extensions to address queueing in your applications like RabbitMQ_; Phalcon provides a client for Beanstalk_, a job queueing backend inspired by Memcache_. It’s simple, lightweight, and completely specialized on job queueing.",
    "queue_d861a4bdd04064beee0ad4280b891a07": "Putting Jobs into the Queue",
    "queue_4f0f692e09e17e4965af1c96ee80c35e": "After connecting to Bens can insert as many jobs as required. The developer can define the message structure according to the needs of the application:",
    "queue_2a3800c31fb6ed307886a661769c5729": "Connect to the queue",
    "queue_b2d990e5adc30102881181c0c68bda78": "Insert the job in the queue",
    "queue_7dfd67b804f06fd719dc552d4dc87303": "Available connection options are:",
    "queue_97c986c9576036cdfaf9caa988b20129": "In the above example we stored a message which will allow a background job to process a video. The message is stored in the queue immediately and does not have a certain time to life.",
    "queue_50037fc1e92a52022435c16bd4fa4115": "Additional options as time to run, priority and delay could be passed as second parameter:",
    "queue_e1f0588bcc119cfc8b55c2b58722f953": "Insert the job in the queue with options",
    "queue_adefa153f60c1a9713e386ee3ef52b3a": "The following options are available:",
    "queue_792805419afcd14aa9b9ade1c8b637ae": "Every job put into the queue returns a \"job id\" the developer can use to track the status of the job:",
    "queue_d005fd4b7ced2a8f6064edcbd43f7614": "Retrieving Messages",
    "queue_6194507a7a197e897f39cdf27349775a": "Once a job is placed into the queue, those messages can be consumed by a background job which have enough time to complete the task:",
    "queue_fa84d1fa18924ca5203ffeccd04eaafd": "Jobs must be removed from the queue to avoid double processing. If multiple background jobs workers are implemented, jobs must be \"reserved\" so other workers don't re-process them while other workers have them reserved:",
    "queue_8259d74e2240c8655ba5a57864dc70ea": "Our client implement a basic set of the features provided by Beanstalkd but enough to allow you to build applications implementing queues."
}