{
    "translate_98c9d4681c477ea707d4970e7778f6a8": "Multi-lingual Support",
    "translate_e2a32b33e39ede9f0811702ad8db95e8": "The component :doc:`Phalcon\\\\Translate <..\/api\/Phalcon_Translate>` aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
    "translate_59016d3191a4f3dbf5870903d350a278": "Adapters",
    "translate_db2308e32b86da819830c6c2e5abd251": "This component makes use of adapters to read translation messages from different sources in a unified way.",
    "translate_8a2060f36ca4f202fdf743f442c4474a": "Component Usage",
    "translate_52e146ffe8d9422a0563efc4216170b8": "Translation strings are stored in files. The structure of these files could vary depending of the adapter used. Phalcon gives you the freedom to organize your translation strings. A simple structure could be:",
    "translate_5f21c2607542fbb7686ddd3b43fa3682": "Each file contains an array of the translations in a key\/value manner. For each translation file, keys are unique. The same array is used in different files, where keys remain the same and values contain the translated strings depending on each language.",
    "translate_8b0b12a88ef5128b39666de8b788b264": "app\/messages\/es.php",
    "translate_cc3b719c877ead78d454923a5e5d7420": "app\/messages\/fr.php",
    "translate_8a5da1e9769e7aef5ff07e8ee18d8f46": "Implementing the translation mechanism in your application is trivial but depends on how you wish to implement it. You can use an automatic detection of the language from the user's browser or you can provide a settings page where the user can select their language.",
    "translate_b0a1958fe3562413949683b75c11bb9b": "A simple way of detecting the user's language is to parse the $_SERVER['HTTP_ACCEPT_LANGUAGE'] contents, or if you wish, access it directly by calling $this->request->getBestLanguage() from an action\/controller:",
    "translate_c0f47784dfc36ca54240ce06646e7ccd": "Ask browser what is the best language",
    "translate_567208363f055f6525775a8bb47210ff": "Check if we have a translation file for that lang",
    "translate_d95196f5979412387168a9a2b0c5d6cf": "fallback to some default",
    "translate_8cc0522120c34ed36d85b89756eed0b7": "Return a translation object",
    "translate_2ff7c999eb2ae79e0b87ae7cbf371ac7": "The _getTranslation method is available for all actions that require translations. The $t variable is passed to the views, and with it, we can translate strings in that layer:",
    "translate_7eb87d7bf9fe530fd9fae17b33249c82": "The \"_\" function is returning the translated string based on the index passed. Some strings need to incorporate placeholders for calculated data i.e. Hello %name%. These placeholders can be replaced with passed parameters in the \"_ function. The passed parameters are in the form of a key\/value array, where the key matches the placeholder name and the value is the actual data to be replaced:",
    "translate_09613af9cbc9a0e2587a2beaac3dec73": "Some applications implement multilingual on the URL such as http:\/\/www.mozilla.org\/**es-ES**\/firefox\/. Phalcon can implement this by using a :doc:`Router <routing>`.",
    "translate_206bd6266ccc781d8844f3db2de5d557": "Implementing your own adapters",
    "translate_203d60c4b261829f5f0f43be5147b498": "The :doc:`Phalcon\\\\Translate\\\\AdapterInterface <..\/api\/Phalcon_Translate_AdapterInterface>` interface must be implemented in order to create your own translate adapters or extend the existing ones:"
}