{
    "tutorial_9abbbf47909e7ad733fa62e85cb0db75": "Tutorial 1: Let's learn by example",
    "tutorial_b5a5e9e57656d19a8547aa34121891f4": "Throughout this first tutorial, we'll walk you through the creation of an application with a simple registration form from the ground up. We will also explain the basic aspects of the framework's behavior. If you are interested in automatic code generation tools for Phalcon, you can check our :doc:`developer tools <tools>`.",
    "tutorial_37ce9f89b0b1cb6b762c7196bc18ec5f": "Checking your installation",
    "tutorial_1b7c81bdd8889e1c836ffb605111f96e": "We'll assume you have Phalcon installed already. Check your phpinfo() output for a section referencing \"Phalcon\" or execute the code snippet below:",
    "tutorial_2254c8131756bb51a2ecac8179a78b7b": "The Phalcon extension should appear as part of the output:",
    "tutorial_bcd21c14594d49fe915b68d70495a843": "Creating a project",
    "tutorial_264e9e5fa61443e3d949a5b9c3b5af4c": "The best way to use this guide is to follow each step in turn. You can get the complete code `here <https:\/\/github.com\/phalcon\/tutorial>`_.",
    "tutorial_e43ba4039b13f24962a8c6077d982e4b": "File structure",
    "tutorial_61cd3d35ca698a2955d9cb11fa63ca24": "Phalcon does not impose a particular file structure for application development. Due to the fact that it is loosely coupled, you can implement Phalcon powered applications with a file structure you are most comfortable using.",
    "tutorial_e213c33711b80713e577d9c25337c509": "For the purposes of this tutorial and as a starting point, we suggest the following structure:",
    "tutorial_d69fe7a293029155d4f8eb9706d65cc1": "Note that you don't need any \"library\" directory related to Phalcon. The framework is available in memory, ready for you to use.",
    "tutorial_c9201f5cc910e6fa29ca3304fee066a1": "Beautiful URLs",
    "tutorial_1fec206e257daffc0d5b007cdfd72e72": "We'll use pretty (friendly) URLs for this tutorial. Friendly URLs are better for SEO as well as being easy for users to remember. Phalcon supports rewrite modules provided by the most popular web servers. Making your application's URLs friendly is not a requirement and you can just as easily develop without them.",
    "tutorial_0a2bafae2f2945e3d51e54c2cb96a16c": "In this example we'll use the rewrite module for Apache. Let's create a couple of rewrite rules in the \/tutorial\/.htaccess file:",
    "tutorial_01919fda1bcf16efef7a53cd304cef25": "All requests to the project will be rewritten to the public\/ directory making it the document root. This step ensures that the internal project folders remain hidden from public viewing and thus eliminates security threats of this kind.",
    "tutorial_8c4cb378ab50e4fb92587f3b8459b2fb": "The second set of rules will check if the requested file exists and, if it does, it doesn't have to be rewritten by the web server module:",
    "tutorial_e942a5f80992ee93b462ea2482b2afc5": "Bootstrap",
    "tutorial_aebd8b2ff258a0ae81307e715cb76197": "The first file you need to create is the bootstrap file. This file is very important; since it serves as the base of your application, giving you control of all aspects of it. In this file you can implement initialization of components as well as application behavior.",
    "tutorial_4e04bc143fc46769f56e4ce0ad9bcfd2": "The tutorial\/public\/index.php file should look like:",
    "tutorial_a03eb182a7972d89257df899a9e4893e": "Register an autoloader",
    "tutorial_446a265dc67feeb5747918302f071767": "Create a DI",
    "tutorial_b2c341141b8e4ea7f05673ec24bc33a4": "Setup the view component",
    "tutorial_dde6aea21ee4354fac975e3a53f8c93e": "Setup a base URI so that all generated URIs include the \"tutorial\" folder",
    "tutorial_6e390072cbe16eea871f567953e9ed8f": "Handle the request",
    "tutorial_adfc9fa0f9bf18986bec56424adfc389": "Autoloaders",
    "tutorial_308de505979c88301dc76dab7905de5b": "The first part that we find in the bootstrap is registering an autoloader. This will be used to load classes as controllers and models in the application. For example we may register one or more directories of controllers increasing the flexibility of the application. In our example we have used the component Phalcon\\\\Loader.",
    "tutorial_bea35d534246978a6e020a6d7f5803f3": "With it, we can load classes using various strategies but for this example we have chosen to locate classes based on predefined directories:",
    "tutorial_f0f4e1a66ec21c03b055d8e501cb4fa7": "Dependency Management",
    "tutorial_860a7ed52147d82b4589219e54d068f0": "A very important concept that must be understood when working with Phalcon is its :doc:`dependency injection container <di>`. It may sound complex but is actually very simple and practical.",
    "tutorial_35de02fc6f0f765eb64a8c213b2695dd": "A service container is a bag where we globally store the services that our application will use to function. Each time the framework requires a component, it will ask the container using an agreed upon name for the service. Since Phalcon is a highly decoupled framework, Phalcon\\\\DI acts as glue facilitating the integration of the different components achieving their work together in a transparent manner.",
    "tutorial_b10343867d5a38ecabb698a8d89077c2": "In the next part, we register the \"view\" service indicating the directory where the framework will find the views files. As the views do not correspond to classes, they cannot be charged with an autoloader.",
    "tutorial_54b32d459a9b3b57d1404dcb59734101": "Services can be registered in several ways, but for our tutorial we'll use an `anonymous function`_:",
    "tutorial_2fa24b32d87705508df644418a1f0c40": "Next we register a base URI so that all URIs generated by Phalcon include the \"tutorial\" folder we setup earlier. This will become important later on in this tutorial when we use the class :doc:`\\Phalcon\\\\Tag <..\/api\/Phalcon_Tag>` to generate a hyperlink.",
    "tutorial_6a03823c97626be953b1e72793b46c33": "In the last part of this file, we find :doc:`Phalcon\\\\Mvc\\\\Application <..\/api\/Phalcon_Mvc_Application>`. Its purpose is to initialize the request environment, route the incoming request, and then dispatch any discovered actions; it aggregates any responses and returns them when the process is complete.",
    "tutorial_ea446940ef9793df0a8c379dccd7e357": "As you can see, the bootstrap file is very short and we do not need to include any additional files. We have set ourselves a flexible MVC application in less than 30 lines of code.",
    "tutorial_8ca989fe8012615fbfff3eae4fa94e0e": "Creating a Controller",
    "tutorial_c20772bfe84aac26eb561e3cbb13d636": "By default Phalcon will look for a controller named \"Index\". It is the starting point when no controller or action has been passed in the request. The index controller (app\/controllers\/IndexController.php) looks like:",
    "tutorial_87a0fd97020586b8d3ea50d9a80b5966": "The controller classes must have the suffix \"Controller\" and controller actions must have the suffix \"Action\". If you access the application from your browser, you should see something like this:",
    "tutorial_a0eaaf846c3bcd2d9077c39874eaf46d": "Congratulations, you're flying with Phalcon!",
    "tutorial_cf5eb363412ee2010ef114fd5786aa7e": "Sending output to a view",
    "tutorial_339029b02b632c371d94ba2aebd0756e": "Sending output to the screen from the controller is at times necessary but not desirable as most purists in the MVC community will attest. Everything must be passed to the view that is responsible for outputting data on screen. Phalcon will look for a view with the same name as the last executed action inside a directory named as the last executed controller. In our case (app\/views\/index\/index.phtml):",
    "tutorial_acc613471f1f1f8c8d40573a8655a821": "Our controller (app\/controllers\/IndexController.php) now has an empty action definition:",
    "tutorial_d99e70949cc78eb3ca77eb0de64f1e1d": "The browser output should remain the same. The :doc:`Phalcon\\\\Mvc\\\\View <..\/api\/Phalcon_Mvc_View>` static component is automatically created when the action execution has ended. Learn more about :doc:`views usage here <views>` .",
    "tutorial_c60c8e77213c05815057aebb475194ec": "Designing a sign up form",
    "tutorial_55841a53ac2ee2c9420c8d664a04df95": "Now we will change the index.phtml view file, to add a link to a new controller named \"signup\". The goal is to allow users to sign up within our application.",
    "tutorial_00c68781ce1f57f729e14511d21210e0": "The generated HTML code displays an anchor (\"a\") HTML tag linking to a new controller:",
    "tutorial_e344ac99aac31560af177fc001e82872": "To generate the tag we use the class :doc:`\\Phalcon\\\\Tag <..\/api\/Phalcon_Tag>`. This is a utility class that allows us to build HTML tags with framework conventions in mind. A more detailed article regarding HTML generation can be :doc:`found here <tags>`",
    "tutorial_96c5338c6359b3dd55fb6e81befe2739": "Here is the Signup controller (app\/controllers\/SignupController.php):",
    "tutorial_974c0b1cc84d10d4fdf4f0c71a705e97": "The empty index action gives the clean pass to a view with the form definition (app\/views\/signup\/index.phtml):",
    "tutorial_f037b090c33d60731430464d96e62e07": "Viewing the form in your browser will show something like this:",
    "tutorial_025dbc566325d89aca099fac244edae7": "The Phalcon\\\\Tag::form method receives only one parameter for instance, a relative uri to a controller\/action in the application.",
    "tutorial_61b7c804bb7efcfcabdcaeff61da855d": "By clicking the \"Send\" button, you will notice an exception thrown from the framework, indicating that we are missing the \"register\" action in the controller \"signup\". Our public\/index.php file throws this exception:",
    "tutorial_ddde1aec1f283152d2b26374920da4ca": "    PhalconException: Action \"register\" was not found on controller \"signup\"",
    "tutorial_50b8655eb688bc4fd616fe4cd490c7d3": "Implementing that method will remove the exception:",
    "tutorial_a485ff15835fc97acf6d435e9dc2c714": "If you click the \"Send\" button again, you will see a blank page. The name and email input provided by the user should be stored in a database. According to MVC guidelines, database interactions must be done through models so as to ensure clean object-oriented code.",
    "tutorial_0199fa0781bc2af2736301fc88a34dff": "Creating a Model",
    "tutorial_d83190abfc28016cd871726d2d6a760b": "Phalcon brings the first ORM for PHP entirely written in C-language. Instead of increasing the complexity of development, it simplifies it.",
    "tutorial_c9a7ff2f489fe74a934e87905cf1053a": "Before creating our first model, we need to create a database table outside of Phalcon to map it to. A simple table to store registered users can be defined like this:",
    "tutorial_8bf8e13170a848eba43fd0cbd1f511ea": "A model should be located in the app\/models directory (app\/models\/Users.php). The model maps to the \"users\" table:",
    "tutorial_862828392de7bf95c93884e331aeb4c9": "Setting a Database Connection",
    "tutorial_113f938008170c70ac87517a5716d95b": "In order to be able to use a database connection and subsequently access data through our models, we need to specify it in our bootstrap process. A database connection is just another service that our application has that can be used for several components:",
    "tutorial_748cc1e41c403cd76458fba2c9792f85": "Setup the database service",
    "tutorial_1437da6e511407a3142304855b3e3fb2": "With the correct database parameters, our models are ready to work and interact with the rest of the application.",
    "tutorial_5d444f51481baf36231e6a4e185a8158": "Storing data using models",
    "tutorial_8f44876d9d106d13cbeda0fd65a260d5": "Receiving data from the form and storing them in the table is the next step.",
    "tutorial_165a70665697d1966f0c513b23093766": "Store and check for errors",
    "tutorial_2b27fa2286c04daecdf3262e3d65d3b4": "We then instantiate the Users class, which corresponds to a User record. The class public properties map to the fields of the record in the users table. Setting the relevant values in the new record and calling save() will store the data in the database for that record. The save() method returns a boolean value which indicates whether the storing of the data was successful or not.",
    "tutorial_4eeecf37adf3f1d3d88107a6e24c97d8": "The ORM automatically escapes the input preventing SQL injections so we only need to pass the request to the save method.",
    "tutorial_f2796cda2b6284d9e5dc8902fac3a87c": "Additional validation happens automatically on fields that are defined as not null (required). If we don't enter any of the required fields in the sign up form our screen will look like this:",
    "tutorial_ee50f1d496b9cd00d5955f10f6dc7517": "Conclusion",
    "tutorial_ac62b9a74c27c662143e17d4072c0e4c": "This is a very simple tutorial and as you can see, it's easy to start building an application using Phalcon. The fact that Phalcon is an extension on your web server has not interfered with the ease of development or features available. We invite you to continue reading the manual so that you can discover additional features offered by Phalcon!",
    "tutorial_caf1e6f2f68b381886575c075f1fb61b": "Sample Applications",
    "tutorial_e69c20c6aafef23fa8314a4414be15b7": "The following Phalcon-powered applications are also available, providing more complete examples:",
    "tutorial_8641484a3c99dfccbeddb0a1898f3ce1": "* `INVO application`_: Invoice generation application. Allows for management of products, companies, product types. etc. * `PHP Alternative website`_: Multilingual and advanced routing application * `Album O'Rama`_: A showcase of music albums, handling big sets of data with :doc:`PHQL <phql>` and using :doc:`Volt <volt>` as template engine * `Phosphorum`_: A simple and clean forum"
}