{
    "whats-next_ac5979c40cf0f922d23b99b0f63326ef": "Increasing Performance: What's next?",
    "whats-next_4951fecfe8ea04204482ba901a13ac35": "Get faster applications requires refine many aspects: server, client, network, database, web server, static sources, etc. In this chapter we highlight scenarios where you can improve performance and how detect what is really slow in your application.",
    "whats-next_8a5e5cd07086bfd5256478af76a0c9db": "Profile on the Server",
    "whats-next_d499955109185531dee06e38e6371a79": "Each application is different, the permanent profiling is important to understand where performance can be increased. Profiling gives us a real picture on what is really slow and what does not. Profiles can vary between a request and another, so it is important to make enough measurements to make conclusions.",
    "whats-next_5116de9f40ec1c3dd8aafed76c961ba3": "Profiling with XDebug",
    "whats-next_a4925be86d5b8f4d2809c47a6564e026": "Xdebug_ provides an easier way to profile PHP applications, just install the extension and enable profiling in the php.ini:",
    "whats-next_b38d10ababd4d8fc1f2ab1d270538b5b": "Using a tool like Webgrind_ you can see which functions\/methods are slower than others:",
    "whats-next_244719d3a37013227a2f4f2e69954e66": "Profiling with Xhprof",
    "whats-next_988fb6562d947f8da0ae75c1501d0da5": "Xhprof_ is another interesting extension to profile PHP applications. Add the following line to the start of the bootstrap file:",
    "whats-next_c3f35ed9003d3e458d7c35470f58797a": "Then at the end of the file save the profiled data:",
    "whats-next_efb07d608d7b87bc1a001af0d1f8a864": "Xhprof provides a built-in html viewer to analize the profiled data:",
    "whats-next_f7dc7675831e283edd54b6e7e3501a7e": "Profiling SQL Statements",
    "whats-next_52ed6613f5a2828779a7c8d3b312fd4c": "Most database systems provide tools to identify slow SQL statements. Detecting and fixing slow queries is very important in order to increase performance in the server side. In the Mysql case, you can use the slow query log to know what SQL queries are taking more time than expected:",
    "whats-next_a32a80fb655426107d82517b69a02162": "Profile on the Client",
    "whats-next_05c5af5d5d4afd8b0aebc3b4a61088ae": "Sometimes we may need to improve the loading of static elements such as images, javascript and css to improve performance. The following tools are useful to detect common bottlenecks in the client side:",
    "whats-next_22c0f83c8d1e0acedd8bee94e7cf349e": "Profile with Chrome\/Firefox",
    "whats-next_5540d6acf4174d7778e0a7afe8769dc7": "Most modern browsers have tools to profile the page loading time. In Chrome you can use the web inspector to know how much time is taking the loading of the different resources required by a single page:",
    "whats-next_7d06b0c1d56eb8a4de4749e396711d85": "Firebug_ provides a similar functionality:",
    "whats-next_2bff9cea84721eb4139848329ad036c8": "Yahoo! YSlow",
    "whats-next_2ea565e1bb92397ce43e91584ab8d34f": "YSlow_ analyzes web pages and suggests ways to improve their performance based on a set of `rules for high performance web pages`_",
    "whats-next_22ac3220308de49b56b20e639030771d": "Profile with Speed Tracer",
    "whats-next_d4b0ef7b36a7cbef8cc66960f6955e4a": "`Speed Tracer`_ is a tool to help you identify and fix performance problems in your web applications. It visualizes metrics that are taken from low level instrumentation points inside of the browser and analyzes them as your application runs. Speed Tracer is available as a Chrome extension and works on all platforms where extensions are currently supported (Windows and Linux).",
    "whats-next_c8aefabe5f595f5a833712a524f40565": "This tool is very useful because it help you to get the real time used to render the whole page including HTML parsing, Javascript evaluation and CSS styling.",
    "whats-next_0e3f773cfbd4657074ab27048bbb56a8": "Use a recent PHP version",
    "whats-next_995f284bdefafa3803b23d0f65e6dcfb": "PHP is faster every day, using the latest version improves the performance of your applications and also of Phalcon.",
    "whats-next_d06ae3ababdb7f62581c61f473410f6b": "Use a PHP Bytecode Cache",
    "whats-next_be4aca0e28427136d4df0db25c8b4068": "APC_ as many other bytecode caches help an application to reduce the overhead of read, tokenize and parse PHP files in each request. Once the extension is installed use the following setting to enable APC:",
    "whats-next_9bdd7f9dc4aee583ebe2cf085ba01f30": "PHP 5.5 includes a built-in bytecode cache called ZendOptimizer+, this extension is also available for 5.3 and 5.4.",
    "whats-next_8f9d9970427920451acf7c4983e22144": "Do blocking work in the background",
    "whats-next_236c23116970492ef2f675241540f17b": "Process a video, send e-mails, compress a file or an image, etc., are slow tasks that must be processed in background jobs. There are a variety of tools that provide queuing or messaging systems that work well with PHP:",
    "whats-next_a83b3f6a1c7d4e612bcdb95a370a1e27": "* `Beanstalkd <http:\/\/kr.github.io\/beanstalkd\/>`_ * `Redis <http:\/\/redis.io\/>`_ * `RabbitMQ <http:\/\/www.rabbitmq.com\/>`_ * `Resque <https:\/\/github.com\/chrisboulton\/php-resque>`_ * `Gearman <http:\/\/gearman.org\/>`_ * `ZeroMQ <http:\/\/www.zeromq.org\/>`_",
    "whats-next_31bc881424156d5e7144482cfb01c98f": "Google Page Speed",
    "whats-next_c5b991040c0cf0ab6cc0b5a08a9523a6": "mod_pagespeed_ speeds up your site and reduces page load time. This open-source Apache HTTP server module (also available for nginx as ngx_pagespeed) automatically applies web performance best practices to pages, and associated assets (CSS, JavaScript, images) without requiring that you modify your existing content or workflow."
}