{
    "acl_35d27b8250bff15a9954c9f91a0bb3c9": "Phân quyền ứng dụng truy cập ACL",
    "acl_adbc41ed0c0c423bf90223c0372e0f78": ":doc:`Phalcon\\\\Acl <../api/Phalcon_Acl>` cung cấp cơ chế phân quyền ACL tương đối mạnh mẽ và dễ sữ dụng. `Access Control Lists`_ (ACL)  cho phép chúng ta truy cập  ứng dụng thông qua một đối tượng hoặc một khu vực nào đó chẳn hạn như các action tương ứng trong controller.  ",
    "acl_e52970115d496c048249a820a58b136a": "In summary, ACLs have roles and resources. Resources are objects which abide by the permissions defined to them by the ACLs. Roles are objects that request access to resources and can be allowed or denied access by the ACL mechanism.",
    "acl_77f422ae2f33689becc2fff60ab01380": "Creating an ACL",
    "acl_82cdf253f5974cfd72e9a832b0ef83a1": "This component is designed to initially work in memory. This provides ease of use and speed in accessing every aspect of the list. The :doc:`Phalcon\\\\Acl <../api/Phalcon_Acl>` constructor takes as its first parameter an adapter used to retriever the information related to the control list. An example using the memory adapter is below:",
    "acl_9ca054c0d303ac1dad25b7beb76c86c7": "By default :doc:`Phalcon\\\\Acl <../api/Phalcon_Acl>` allows access to action on resources that have not been yet defined. To increase the security level of the access list we can define a \"deny\" level as a default access level.",
    "acl_a2b321754df456f64c5e1ab2fbd3bb6d": "Default action is deny access",
    "acl_af39885efdd670a4d3409f86d065352b": "Adding Roles to the ACL",
    "acl_d8b6c24974ec49a7de0931969dbb69c6": "A role is an object that can or cannot access certain resources in the access list. As an example, we will define roles as groups of people in an organization. The :doc:`Phalcon\\\\Acl\\\\Role <../api/Phalcon_Acl_Role>` class is available to create roles in a more structured way. Let's add some roles to our recently created list:",
    "acl_21e051ef1d092d0b1a5ddec0bef33b9c": "Create some roles",
    "acl_e497d9691f5d8e2fc5cb41d685a2145a": "Add \"Guests\" role to acl",
    "acl_bb6b83d94014dcfdfaa487d4e35babd4": "Add \"Designers\" role to acl without a Phalcon\\Acl\\Role",
    "acl_b280833c0715b119a7989f7d286b737f": "As you can see, roles are defined directly without using an instance.",
    "acl_647e8a84d61a2443e8d863a01727bdb8": "Adding Resources",
    "acl_d0b887d6f2f2316bdcfb3388a5fb7d18": "Resources are objects where access is controlled. Normally in MVC applications resources refer to controllers. Although this is not mandatory, the :doc:`Phalcon\\\\Acl\\\\Resource <../api/Phalcon_Acl_Resource>` class can be used in defining resources. It's important to add related actions or operations to a resource so that the ACL can understand what it should to control.",
    "acl_f274c5592fac24c04d7113d3844cbdd9": "Define the \"Customers\" resource",
    "acl_bc727b5dce45b9c2738dbf9fa8f93676": "Add \"customers\" resource with a couple of operations",
    "acl_39f1b51bee0b3e71aa72bd338104fca6": "Defining Access Controls",
    "acl_ed44085894ac59a68ac1ca5315ff73f1": "Now we've roles and resources. It's time to define the ACL i.e. which roles can access which resources. This part is very important especially taking in consideration your default access level \"allow\" or \"deny\".",
    "acl_4b17262ed636f44d00c8e917dacad39e": "Set access level for roles into resources",
    "acl_ce64c2a97332ea72b17dda609ac2f361": "The allow method designates that a particular role has granted access to access a particular resource. The deny method does the opposite.",
    "acl_a5b93a112061fdc9876d21f96101e20e": "Querying an ACL",
    "acl_9f89b2d7a704bda130e600b7aef4063e": "Once the list has been completely defined. We can query it to check if a role has a given permission or not.",
    "acl_ce3445ff79c3445a6db89250e0049b3f": "Check whether role has access to the operations",
    "acl_0b2da28a441d04619e64bdbd1693747c": "Returns 0",
    "acl_691d9ca32d3773a83b41f05322d4c409": "Returns 1",
    "acl_8a27d9b40bc8d803daea548f997357b7": "Roles Inheritance",
    "acl_80a17801e24f2a52b7979f12557663d5": "You can build complex role structures using the inheritance that :doc:`Phalcon\\\\Acl\\\\Role <../api/Phalcon_Acl_Role>` provides. Roles can inherit from other roles, thus allowing access to supersets or subsets of resources. To use role inheritance, you need to pass the inherited role as the second parameter of the function call, when adding that role in the list.",
    "acl_088f8b957b4a2224e07d2d0ae5382ffd": "Add \"Administrators\" role inheriting from \"Guests\" its accesses",
    "acl_12624f31b9a5c9d94c4533f8f8b52c42": "Serializing ACL lists",
    "acl_67f68b730ec4de1a0cfadeeff91bb0aa": "To improve performance :doc:`Phalcon\\\\Acl <../api/Phalcon_Acl>` instances can be serialized and stored in APC, session, text files or a database table so that they can be loaded at will without having to redefine the whole list. You can do that as follows:",
    "acl_c55dd0db3e994683568f64d1ea2842d3": "Check whether acl data already exist",
    "acl_6767be5450af756eddedcce3ca428b19": "... Define roles, resources, access, etc",
    "acl_42e15baacf37e48c8b6b0fc3d685343a": "Store serialized list into plain file",
    "acl_6f3131205fcad5ed8c2c9a9d1dd15f19": "Restore acl object from serialized file",
    "acl_2d332db098013fb168ecca2f52d5d3b1": "Use acl list as needed",
    "acl_5ec3a4b22225d07937424121b51b1319": "Acl Events",
    "acl_b7d11adb78dba3c9e8fcc5b19fa49d62": ":doc:`Phalcon\\\\Acl <../api/Phalcon_Acl>` is able to send events to a :doc:`EventsManager <events>` if it's present. Events are triggered using the type \"acl\". Some events when returning boolean false could stop the active operation. The following events are supported:",
    "acl_4eb434eb37be7b4a57c178fa4af88c76": "The following example demonstrates how to attach listeners to this component:",
    "acl_41b79f8cf8c0967be09fcf51a7674d17": "Create an event manager",
    "acl_858f186aeef8329bf7131c4abdfb4c4a": "Attach a listener for type \"acl\"",
    "acl_cfa3b815c7d6f73ea6e0098449910686": "Setup the $acl",
    "acl_51961227af6de88a757992584152f3e7": "Bind the eventsManager to the acl component",
    "acl_206bd6266ccc781d8844f3db2de5d557": "Implementing your own adapters",
    "acl_3f41296882bcc0cbef74b4d784e02dab": "The :doc:`Phalcon\\\\Acl\\\\AdapterInterface <../api/Phalcon_Acl_AdapterInterface>` interface must be implemented in order to create your own ACL adapters or extend the existing ones."
}