{
  "about": "Περί",
  "about_blog": "BLOG",
  "about_blog_1": "Εάν σας αρέσει να γράφετε, μη ξεχνάτε ότι το <a href=':1:'>blog μας</a> είναι ανοιχτό να τα άρθρα σας. Αν έχετε ένα δικό σας blog και έχετε γράψει κάτι για το Phalcon, μπορούμε να το δημοσιεύσουμε στο κοινωνικό δίκτυο μας, ώστε να επιτευχθεί η μέγιστη ορατότητα. Αν το blog σας είναι σε μια γλώσσα εκτός της αγγλικής, θέλουμε να το μοιραστούμε και να το μεταφράσουμε αν είναι δυνατόν. Εάν γνωρίζετε σχετικά με τα blogs που σχετίζονται με το PHP που ενδιαφέρονται στην παρουσίαση του Phalcon με το κοινό τους, παρακαλούμε να μας ενημερώσετε.",
  "about_description_1": "Καταπληκτικές εφαρμογές χρειάζονται καταπληκτικούς προγραμματιστές. Μπορεί να μην σας γνωρίζουμε ακόμα, αλλά νομίζουμε ότι θα είστε ένα καταπληκτικό ταίρι για τη δημιουργία ενός καλύτερου ιστού. Μαζί, είμαστε έτοιμοι να αλλάξουμε τον κόσμο! Εδώ στο Phalcon, χτίζουμε το νέας γενιάς framework για το PHP. Θέλουμε να σας δώσουμε καταπληκτική απόδοση, ενώ παράλληλα να  βοηθήσουμε την ανάπτυξη των εφαρμογών σας με έναν εύκολο και διασκεδαστικό τρόπο.",
  "about_description_2": "Ελπίζουμε ότι απολαμβάνετε το Phalcon, όσο και εμείς. Καλωσορίζουμε πάντα τη συνεργασία και τη βοήθεια σας! <strong>Δεν χρειάζεται να είσαστε προγραμματιστές στη C για να βοηθήσετε το Phalcon!</strong> Υπάρχουν πολλές άλλες περιοχές που μπορείτε να συνεισφέρετε:",
  "about_documentation": "ΤΕΚΜΗΡΙΩΣΗ",
  "about_documentation_1": "Το repository αυτής της ιστοσελίδας είναι διαθέσιμο στο <a href=':1:'>github</a>. Χρησιμοποιούμε <a href=':2:'>readthedocs</a> τη διαχείρηση της τεκμηρίωσης μας. <br /> <br /> Εκτιμούμε πάντα διορθώσεις, προσθήκες και βελτιώσεις στην τεκμηρίωσή μας, ώστε το μόνο που έχετε να κάνετε είναι να κάνετε clone το repository και να στείλετε pull request! <br /> <br /> αν μπορείτε να βοηθήσετε προγραμματιστές που δε μιλούν Αγγλικά με τη μετάφραση του περιεχόμενου σε μια άλλη γλώσσα, θα το εκτομήσουμε πλαρα πολύ!",
  "about_donations_sponsoring": "ΔΩΡΕΕΣ / ΥΠΟΣΤΗΡΗΚΤΕΣ",
  "about_evangelism": "ΕΥΑΓΓΕΛΙΣΜΟΣ",
  "about_evangelism_1": "Υπάρχουν πολλοί προγραμματιστές που εξακολουθούν να μην γνωρίζουν ότι Phalcon υπάρχει ή ότι λειτουργεί πραγματικά. Είμαστε σίγουροι ότι πολλοί προγραμματιστές θα επωφεληθούν από ακούσουν για το Phalcon και πώς μπορεί να τους βοηθήσει. Αν γνωρίζετε οποιεσδήποτε εκδηλώσεις/συναντήσεις PHP και θέλετε να δώσετε μια ομιλία για το Phalcon , έχετε την πλήρη υποστήριξή μας. Ποιος δεν θα ήθελε να μάθει για το εργαλείο που φέρνει επανάσταση στην ανάπτυξη εφαρμογών PHP;",
  "about_facebook_page": "Σελίδα Facebook",
  "about_flying_with_phalcon": "Σας ευχαριστούμε που πετάτε με το Phalcon &lt;3",
  "about_follow_on_gab": "Ακολοθήστε μας στο Gab",
  "about_follow_on_twitter": "Ακολοθήστε μας στο Twitter",
  "about_google_plus_page": "Σελίδα Google+",
  "about_official_blog": "Επίσημο Blog",
  "about_sample_applications": "ΔΕΙΓΜΑΤΑ ΕΦΑΡΜΟΓΩΝ",
  "about_sample_apps_1": "Παραδείγματα μεγάλων εφαρμογών βοηθούν άλλους προγραμματιστές να κατανοήσουν καλύτερα το πώς μεγάλες εφαρμογές μπορούν να δημιουργηθούν με το Phalcon. Μη διστάσετε να μοιραστείτε μαζί μας repositories δειγμάτων εφαρμογών,  βοηθώντας άλλους προγραμματιστές με τη δουλειά τους και επιτρέπωντας άλλους να σας δώσουν ανατροφοδότηση για τη δουλειά σας!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Όλοι αγαπούν τα screencasts. Αν έχετε παραπανήσιο χρόνο και θέλετε να υποστηρίξετς την κοινότητα με μερικά ωραία βίντεο διδασκαλίας, για κάποια από τα χαρακτηριστικά του framework, θα χαρούμε να τα λάβουμε. Δείτε το <a href=\":1:\">κανάλι μας στο Vimeo</a> σαν οδηγό.",
  "about_share_experiences_1": "Μη ντέπεστε, μοιραστείτε με την κοινώτητα και με μας, τους τρόπους μέσω τους οποίους το Phalcon ήταν χρήσιμο για σας. Αν το Phalcon επέφερε επιτυχία σε σας, ας το μοιραστούμε με την κοινότητα. Επίσης, συζητήστε μαζί μας για το ποια στοιχεία χρειάζονται επιπλέον εργασία, τι θα μπορούσατε να κάνετε πιο εύκολα και ποια είναι τα οφέλη σας με τη χρήση του Phalcon. Παρόλο που όλες οι αιτήσεις αλλαγών/βελτιώσεων δεν μπορούν να υλοποιηθούν άμεσα, η συμβολή σας στις αιτήσεις νέων βελτιώσεων σε μεγάλο βαθμό μας βοηθάει να διαμορφώσουμε το μέλλον του Phalcon. Η γνώμη σας βοηθά όλους μας.",
  "about_share_your_experiences": "ΜΟΙΡΑΣΤΕΙΤΕ ΤΙΣ ΕΝΤΥΠΩΣΕΙΣ ΣΑΣ",
  "about_social_networks": "ΚΟΝΩΝΙΚΑ ΔΙΚΤΥΑ",
  "about_social_networks_1": "Το Phalcon εξελίσσεται σε καθημερινή βάση, μέσα από την επιθυμία μας να το καλυτερεύσουμε. Τα κοινωνικά δίκτυα είναι πλέον μέρος της ζωής μας, και όλοι αλληλεπιδρούν με τους άλλους μέσα από αυτά. Μοιραζωντας την εμπειρία σας με το Phalcon με τους κοινωνικούς κύκλους σας, θα βοηθήσει σημαντικά την αύξηση της προβολής του. Σαν αποτέλεσμα, πιό πολλοί χρήστες θα συμμετάσχουν στην κοινότητά μας, καθιστώντας το Phalcon πιο ισχυρό, με περισσότερα χαρακτηριστικά και φήμη. Like, '+ 1', μοιραστήτε άρθρα που αναρτούμε σε κάθε κοινωνικό δίκτυο, συμμετάσχετε σε συζητήσεις σε αυτά τα άρθρα. Οι προγραμματιστές που ανακαλύπτουν το Phalcon μέσω αλληλεπιδράσεών σας θα σας ευχαριστήσουν!",
  "about_social_networks_2": "Έχουμε παρουσία στα περισσότερα από πιό δημοφιλή κοινωνικά δίκτυα. Ακολουθώντας μας, μας βοηθάτε να αυξήσουμε την δημοσιότητα του Phalcon:",
  "about_sponsoring_1": "Είμαστε μιά μικρή αλλά αποτελεσματική βασική ομάδα προγραμματιστών, που εργάζονται πολύ σκληρά. Προσπαθούμε να ξοδέψουμε όσο πιό πολύ χρόνο μπορούμε για το framework.  Όλα το πάθος μας για το framework είναι αυτό μας κάνει να θέλουμε να είναι καλύτερο κάθε μέρα. Το Phalcon είναι λογισμικό ανοιχτού κώδικα και οι προσπάθειες εθελοντών είναι αναγκαίες για τη συνεχή εξέλιξή του. Μπορείτε να μας βοηθήσουν να διατηρήσουμε την ανάπτυξη ενεργό με δωρεές στο framework ή γινόμενοι σπόνσορς στην ανάπτυξης του. Περισσότερος χρόνος και πόροι για το έργο σημαίνει περισσότερη δράση, μεγαλύτερη βελτίωση, καλύτερη υποστήριξη, πιο εκπληκτικά χαρακτηριστικά, κλπ.",
  "about_star_on_github": "Υποβάλλετε αστέρι για το Phalcon στο Github",
  "about_tests": "ΤΕΣΤΣ",
  "about_tests_1": "Κανένα λογισμικό δεν είναι τέλειο. Αν βρείτε κάποιο bug, μη διστάσετε να μας ενημερώσετε. Έχουμε μια σουίτα που συμπεριλαμβάνει περισσότερα από <a href=':1:'> 16.000</a> τέστς. Ωστόσο, η ενιαία τεστς δεν είναι ποτέ αρκετά. Βοηθήστε μας να βελτιώσουμε τη σουίτα μας με την προσθήκη περισσότερων τεστς ή με τη βελτίωση των υφιστάμενων. Κάθε προστιθέμενπ τέστ καλυτερεύει το Phalcon.",
  "about_thank_you": "ΕΥΧΑΡΙΣΤΟΥΜΕ!",
  "about_thank_you_1": "Θα θέλαμε να ευχαριστήσουμε όλους τους εισηγητές και τα μέλη της κοινότητας μας, που μας ενθαρρύνουν να κάνουμε το Phalcon το καλύτερο framework στην κατηγορία του. Τα ευγενικά σας λόγια και η συμμετοχή σας είναι οι παράγοντες που μασ ωθούν να κάνουμε κάτι καλύτερο. Ελπίζουμε να ανταποκριθούμε και να υπερβούμε την εμπιστοσύνη που έχετε στο Phalcon.",
  "about_translations": "ΜΕΤΑΦΡΑΣΕΙΣ",
  "about_translations_1": "Προσπαθούμε να προσεγγίσουμε όσο πιό πολλούς προγραμματιστές το δυνατόν, να ξεπεράσουμε τα εμπόδια γλώσσας. Χρησιμοποιούμε <a href=\":1:\">:2:</a>, για τη διαχείρηση όλων των λέξεων ή φράσεων που πρέπει να μεταφραστούν για αυτή την ιστοσελίδα. Το αποθετήριο της ιστοσελίδας μας <a href=\":3:\">εδώ</a> και παρακάτω μπορείτε να δείτε την τρέχουσα κατάσταση των μεταφραστικών προσπαθειών μας.",
  "acl": "ACL",
  "acl_1": "Ετσι μπορεέιτε να χτίστε τη λίστα ελέγχου πρόσβασης (ACL):",
  "acl_2": "Δημιουργία της ACL",
  "acl_3": "Η προεπιλεγμένη ενέργεια είναι DENY πρόσβαση",
  "acl_4": "Εγγράψτε σε δύο ρόλους, οι Users είναι εγγεγραμμένοι χρήστες",
  "acl_5": "και οι επισκέπτες είναι χρήστες χωρίς μια καθορισμένη ταυτότητα",
  "acl_description": "Access Control List allows users to access the modules they're authorized to\nΗ Λίστα Ελέγχου Πρόσβασης (ACL) επιτρέπει στους χρήστες να έχουν πρόσβαση μόνο στις ενότητες που είναι εξουσιοδοτημένοι",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Δημιουργήστε μητρώο ονομάτων (namespaces), προθέματα, καταλόγους ή τάξεις. Επωφεληθείτε από τα γεγονότα του autoloader και διατηρήστε πλήρη έλεγχο πάνω από ποια αρχεία έχουν φορτωθεί και από πού.",
  "auto_loader_2": "Δημιουργεί τον autoloader",
  "auto_loader_3": "Εγγράψτε μητρώο ονομάτων",
  "auto_loader_4": "Εγγράψτε autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.\nΠαρέχει μηχανισμό αυτόματης φόρτωσης τάξεων PHP ακολουθόντας το PSR-4.",
  "basic_features": "Βασικά χαρακτηριστικά",
  "blog": "Blog",
  "built_with_phalcon": "Φτιαγμένο με το Phalcon",
  "cache": "Cache",
  "cache_1": "Το στοιχείο cache επιτρέπει την ταχύτερη πρόσβαση σε συχνά χρησιμοποιούμενα ή ήδη επεξεργασμένα δεδομένα. Υποστηρίζει πολλά backends όπως Redis, Memcached, Mongo, Files, Apc και παραπάνω.",
  "cache_2": "Δηλώστε την υπηρεσία αποθήκευσης προσωρινών δεδομένων (cache) στα models",
  "cache_3": "Προσωρινή αποθήκευση δεδομένων (cache) για μία ημέρα από προεπιλογή",
  "cache_4": "Ρυθμίσεις σύνδεσης Memcached",
  "cache_description": "Βελτιώσετε την απόδοση της εφαρμογής σας με τις πολλές υπηρεσίες αποθήκευσησ προσωρινών δεδομένων που παρέχει το Phalcon",
  "community": "Κοινότητα",
  "consulting": "Συμβουλευτείτε",
  "consulting_header": "Έχουμε μια συνεργασία με τη LEZGRO, μια εταιρεία που ειδικεύεται στην ανάπτυξη εφαρμογών στον ιστό και κινητής τηλεφωνίασ, και έχουν πολύ εμπειρεία στην ανάπτυξη εφαρμογών με το Phalcon για πελατεία τους.",
  "consulting_lezgro_1": "Η LEZGRO σας συγχάιρει για τιν επολογή σας, κάνωντας το Phalcon μέρος του πυρήνα στην τεχνολογική σας στοίβα!",
  "consulting_lezgro_2": "Δεδομένου ότι η εταιρεία μας είδε για πρώτη φορά το φως της ημέρας το 2003, προσπαθήσαμε διάφορες τεχνολογίες και προσεγγίσεις στην ανάπτυξη λογισμικού.",
  "consulting_lezgro_3": "Μάνατζερς προϊόντων, CTOs και μη τεχνικοί ιδρυτές περιλαμβάνουν LEZGRO για την κατασκευή προϊόντων που ξεχωρίζουν, γρήγορα και με υψηλή ποιότητα.",
  "consulting_lezgro_4": "Τώρα που έχουμε αποκτήσει θετική εμπειρία με το Phalcon, είμαστε ανοιχτοί να σας συμβουλεύσουμε σχετικά με την απόφαση σας για την ανάπτυξη εφαρμογών με το Phalcon και να σας βοηθήσουμε να φέρετε προϊόν σας στην αγορά.",
  "consulting_lezgro_5": "Επικοινωνήστε με τη LEZGRO μέσω της <a href=':1:'>ιστοσελίδας</a> μας, όπου μπορείτε επίσης να δείτε δείγματα και μαρτυρίες της δουλειάς μας.",
  "consulting_mctekk_1": "Η MCTekK άρχισε να χρησιμοποιεί Phalcon από την πρώτη μέρα. Από τη σύλληψή του πλαισίου, είδαμε τα μεγάλα πλεονεκτήματα που το Phalcon προσφέρει τώρα και στο μέλλον.",
  "consulting_mctekk_2": "Έχουμε άφθονη εμπειρία με το Phalcon και έχουμε αναπτύξει μια μυριάδα εφαρμογών με αυτό σαν πυρήνα. Είμαστε εδώ για να σας συμβουλεύσουμε σχετικά με οτιδήποτε χρειάζεστε που αφορά το Phalcon για να σας βοηθήσει να βελτιώσετε την ετοιμότητα, την ταχύτητα και την ποιότητα της εφαρμογής σας.",
  "consulting_mctekk_3": "Επικοινωνήστε μαζί μας μέσω της <a href=':1:'>ιστοσελίδα</a> μας, όπου μπορείτε να πάρετε μια ματιά σε τα έργα που έχουμε συμμετάσχει.",
  "consulting_mctekk_header": "Η MCTekK έχει ήδη παραδώσει  διάφορες εφαρμογές Phalcon υψηλών προδιαγραφών, με κύρια πλεονεκτήματα τους την ανάπτυξη σε ιστό και κινητά.",
  "contribute": "Συνεισφέρετε",
  "contributors": "Phalcon συνεισφέροντες",
  "contributors_description": "Phalcon βελτιώνεται καθημερινά από την φανταστική μας κοινώτητα",
  "crypt": "Crypt",
  "crypt_description": "Κρυπτογράφηση/αποκρυπτογράφηση σημαντικών δεδομένων για να τα κρατήσετε ασφαλή από μη εξουσιοδοτημένα τρίτα μέρη",
  "data_and_storage": "Δεδομένα και αποθήκευση",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Το Phalcon είναι χτισμένο σε ένα ισχυρό και εύκολα κατανοητό πρότυπο που ονομάζεται Dependency Injection. Προετοιμαστε ή ορίστε τις υπηρεσίες μόνο μια φορά - και χρησιμοποιήστε τες οπουδήποτε σην εφαρμογή σας.",
  "dependency_injection_2": "Δημιουργήστε το κοντείνερ του Dependency Injector",
  "dependency_injection_3": "Εγγράψετε τάξεις, συναρτήσεις και εξαρτήματα",
  "dependency_injection_4": "Χρησιμοποιήστε το οπουδήποτε θέλετε στον κώδικα σας",
  "dependency_injection_description": "Dependency Injection και Τοποθεσία υπηρεσιών και είναι το ίδιο ένα δοχείο για αυτούς.",
  "docs": "Τεκμηρίωση",
  "documentation": "Τεκμηρίωση",
  "donate": "Δωρεές",
  "download": "Λήψη",
  "download_arch": "Arch Linux",
  "download_arch_1": "Υπάρχει ένα PKGBUILD για το ArchLinux διαθέσημο <a href=':1:'>εδώ</a>",
  "download_box_1": "Κουτί #1",
  "download_box_2": "Κουτί #2",
  "download_box_doc_root": "Φάκελος εγγράφων ιστού: :1:",
  "download_box_user_pass": "Χρήστης MySQL: :1: Κωδικός: :2:",
  "download_compilation": "Compilation",
  "download_compilation_1": "Στο Linux μπορείτε εύκολα να εγκαταστήσετε την επέκταση από τον πηγαίο κώδικα.",
  "download_compilation_11": "1. Για να δημιουργήσετε την επέκταση από τον πηγαίο κώδικα C ακολουθήστε τα εξής βήματα:",
  "download_compilation_12": "2. Προσθέστε την επέκταση στο φάκελο php.ini:",
  "download_compilation_13": "3. Επανεκκινείστε τον webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Μετά από αιτήματα από την κοινότητα, οι προγραμματιστές του cPanel κυκλοφόρησαν μια προσαρμοσμένη λειτουργική μονάδα που επιτρέπει την εγκατάσταση του Phalcon στις σελίδες φιλοξενείας που διαχειρίζονται με το cPanel. Πληροφορίες μπορούν να βρεθούν <a href=':1:'>εδώ</a>. Η λειτουργική μονάδα διατηρείται στο <a href=':2:'>Github</a>.",
  "download_dependencies": "Εξαρτήσεις",
  "download_dependencies_1": "Παρόλο που το Phalcon δεν έχει δυαδικές συνδέσεις με άλλες επεκτάσεις, χρησιμοποιεί κάποιες από αυτές για πλέον λειτουργικότητα. Οι επεκτάσεις που χρησιμοποιούνται είναι:",
  "download_dependencies_2": "Δεν είναι απαραίτητο για όλες τις παραπάνω επεκτάσεις να είναι παρόντες στο σύστημα που έχει το Phalcon εγκατεστημένο. Μπορείτε να εγκαταστήσετε μόνο αυτές τις επεκτάσεις που ανταποκρίνονται στις ανάγκες σας. Για παράδειγμα, αν χρησιμοποιείτε μια βάση δεδομένων MySQL, τότε μπορείτε να φορτώσετε μόνο τις επεκτλασεις PDO και PDO/MySQLαγνοώντας τις Oracle, SQlite, Postgresql και Mongo.",
  "download_developer_tools": "Εργαλεία για προγραμματιστές",
  "download_devtools_1": "Τα εργαλεία αυτά είναι μια συλλογή από χρήσιμα scripts για τη δημιουργία σκελετό κώδικα. Κύρια μέρη της εφαρμογής σας μπορούν να δημιουργηθούνε με μια απλή εντολή, που σας επιτρέπει να αναπτήξετε πολύ εύκολα εφαρμογές με το Phalcon.",
  "download_devtools_composer": "Εγκατάσταση με Composer",
  "download_devtools_composer_1": "Εγκαταστήστε το composer σε μια κοινή τοποθεσία ή στην εφαρμογή σας:",
  "download_devtools_composer_2": "Δημιουργήστε το αρχείο composer.json ως εξής:",
  "download_devtools_composer_3": "Εκτελέστε το πρόγραμμα εγκατάστασης composer:",
  "download_devtools_composer_4": "Δημιουργήστε μια συμβολική σύνδεση στο phalcon.php script:",
  "download_devtools_docs": "Τεκμηρίωση: <a href=':1:'>Εργαλεία Ανάπτυξης Phalcon</a>",
  "download_devtools_download": "Μπορείτε να κατεβάσετε ή να κλωνοποιήσετε το πακέτο που περιέχει τα εργαλεία ανάπτυξης απο <a href=\":1:\">Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Υπάρχουν πολλοί τρόποι που μπορείτε να χρησιμοποιήσετε το Phalcon με Docker.",
  "download_docker_2": "Τα επίσημα images μας βρίσκονται <a href=':1:'>εδώ</a>. Καλωσορίζουμε πάντα pull requests και βελτιώσεις. Η αποθήκη για τα αρχεία docker βρίσκονται εδώ:",
  "download_docker_3": "Με το Phalcon-compose μπορείτε να δημιουργήσετε ένα απομονωμένο περιβάλλον με docker, που θα σας επιτρέψει να χρησιμοποιήσετε το Phalcon χωρίς οποιεσδήποτε πρόσθετες εγκαταστάσεις. Σημειώστε ότι η χρήση του Phalcon-compose, απαιτεί",
  "download_docker_4": "και",
  "download_docker_5": "Υπηρεσίες",
  "download_docker_6": "Το Phalcon Compose προσφέρει τις ακόλουθες υπηρεσίες:",
  "download_docker_7": "Το Phalcon Compose είναι πολύ εύκολο στη χρήση του. Ας υποθέσουμε ότι θέλετε να δημιουργήσετε μια εφαρμογή που θα βρίσκεται στο:",
  "download_docker_8": "Τώρα θα πρέπει να εκτελέσετε την ακόλουθη εντολή για τη δημιουργία της εφαρμογής μας:",
  "download_docker_9": "Η παραπάνω εντολή θα κατεβάσει το σκελετό του περιβάλλοντος docker.",
  "download_docker_10": "Μεταβλητές",
  "download_docker_11": "Θα χρειαστεί να δημιουργήσετε ένα νέο αρχείο που ονομάζεται",
  "download_docker_12": "στο",
  "download_docker_13": "Ένα δείγμα αρχείου σας παρέχεται και ονομάζεται",
  "download_docker_14": "Προσαρμόσετε τις μεταβλητές στο αρχείο, έτσι ώστε να ταιριάζει στις ανάγκες σας. Η πιο σημαντική μεταβλητή είναι η",
  "download_docker_15": "Αλλάξτε το όνομα σε κάτι που θέλετε να χρησιμοποιήσετε. Στην περίπτωσή μας, αφήνουμε την προεπιλεγμένη που ονομάζεται",
  "download_docker_16": "Ανοίξτε το αρχείο hosts (<code>/etc/hosts</code>) και εισαγάγετε μια νέα γραμμή σαν αυτή:",
  "download_docker_17": "Μπορεί να θέλετε να επεξεργαστείτε το αρχείο <code>docker-compose.yml</code> και να καταργήσετε τις υπηρεσίες που δεν θα χρησιμοποιλησετε. Το Phalcon Compose  προσφέρει πολλές υπηρεσίες όπως αναφέραμε παραπάνς, έτσι ώστε η εφαρμογή σας μπορεί να μην χρειάζεται κάποια από αυτά. Αφαιρώντας σχετικών υπηρεσιών από το αρχείο <code>docker-compose.yml</code> θα μειώσειτη χρήση μνήμης του περιβάλλοντός σας.",
  "download_docker_18": "Χτίσιμο",
  "download_docker_19": "Μπορείτε τώρα να χτίσετε το περιβαλλον σας,",
  "download_docker_20": "Οι containers θα κατεβούνε αν απαιτείται και θα ρυθμιστούν στο περιβαλλον σας.",
  "download_docker_21": "Παρουσίαση",
  "download_docker_22": "Μπορείτε τώρα να εκκινήσετε το περιβάλλον:",
  "download_docker_23": "Πάντε στο :1: στο πρόγραμμα περιήγησής σας και θα δείτε το περιβάλλον σας που έχει ρυθμιστεί. Τώρα, μπορείτε να αναπτύξετε την εφαρμογή σας στο φάκελο app.",
  "download_docker_24": "Τερματισμός λειτουργίας",
  "download_docker_25": "Οταν δε χρειάζεστε το περιβάλλον, μπορείτε να το τερματίσετε με την ακόλουθη εντολή:",
  "download_docker_26": "Πρόσθετες πληροφορίες μπορούν να βρεθούν στο:",
  "download_examples": "Προ-εγκατεστημμένα παραδείγματα",
  "download_examples_1": "Τα παρακάτω παραδείγματα εφαρμογών είναι προ-εγατεστημένα σε κάθε κουτί vagrant:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Ένα port είναι διαθέσιμο για το FreeBSD. Χρειάζεται μόνο αυτές τις λίγες εντολές για να το εγκαταστήσετε:",
  "download_ide_stubs": "Στελέχη IDE",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Θέλετε βοήθεια;",
  "download_need_help_1": "Δείτε τη <a href=\":1:\">σελίδα υποστήρηξης</a> μας, για τρόπους που μπορείτε να βρείτε απαντήσεις στις ερωτήσεις σας. Θα κάνουμε ότι μπορούμε να σας βοηθήσουμε.",
  "download_note": "Το Phalcon είναι μια C επέκταση, οπότε θα πρέπει να κατεβάσετε ένα δυαδικό για την πλατφόρμα σας ή να το μεταφράσετε από τον πηγαίο κώδικα.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Υπάρχει ένα διαθέσιμο πακέτο <a href=':1:'>εδώ</a> (χάρις στον <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Aπαιτήσεις",
  "download_requirements_1": "Χρειάζεστε κάποια πακέτα να έχουν εγκατασταθεί προηγουμένως:",
  "download_requirements_2": "PHP 5.x πόροι για την ανάπτυξη",
  "download_requirements_3": "Πρόγραμμα μεταγλώττισης GCC",
  "download_source_code": "Πηγαίος Κώδικας: <a href=\":1:\" target=\"_download\" title=\"GitHub Repo\">github</a>",
  "download_source_code_switch": "Πηγαίος Κώδικας (παρακαλούμε επισκευτήτε το σχετικό κλάδο): <a href=\":1:\" target=\"_download\" title=\"GitHub Repo\">github</a>",
  "download_ubuntu": "Για να εγκαταστήσετε το Phalcon στο Ubuntu, χρειάζετε να ακολουθήσετε τα παρακάτω βήματα:",
  "download_ubuntu_1": "Αν σας λείπουν apt-add-repository, εκτελέστε την ακόλουθη εντολή:",
  "download_ubuntu_2": "Εάν θέλετε να εγκαταστήσετε την παλαιότερη έκδοση του Phalcon (1.x), χρησιμοποιήστε το ακόλουθο PPA:",
  "download_ubuntu_or_debian": "Ubuntu ή Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> είναι ένα εξαιρετικό εργαλείο για τη δημιουργία και διαμόρφωση ελαφρών και φορητών περιβάλλοντων ανάπτυξης εφαρμογών.",
  "download_vagrant_2": "Χρησιμοποιήστε οποιαδήποτε από τα παρακάτω κουτιά για να δοκιμάσετε ή να αναπτύξετε εφαρμογές με το Phalcon σε ένα προ-ρυθμισμένο περιβάλλον.",
  "download_vagrant_boxes": "Κουτιά Vagrant",
  "download_windows": "Windows DLLs",
  "download_windows_guides": "Σχετικοί Οδηγοί",
  "download_windows_guides_wamp": "Εγκατάσταση σε WAMP",
  "download_windows_guides_xampp": "Εγκατάσταση σε XAMPP",
  "download_windows_installation": "Εγκατάσταση",
  "download_windows_installation_1": "Για να χρησιμοποιήσετε το Phalcon στα Windows, μπορείτε να κατεβάσετε ένα DLL. Επεξεργαστήτε το αρχείο php.ini σας, προσθέστε στο τέλος τις κατάλληλες εντολές, και επανεκκινήστε το webserver σας για να φορτωθεί η επέκταση. <a href=\":1:\">Περισσότερα</a>.",
  "download_windows_note": "Σας συνιστούμε να χρησιμοποιείτε την πιο πρόσφατη έκδοση του PHP που αντιστοιχοεί στα αρχεία DLL μας, έτσι ώστε να επωφεληθοείτε από το πλήρες σύνολο δυνατοτήτων του Phalcon.",
  "download_windows_older": "Παλιότερες εκδόσεις",
  "download_windows_stable": "Σταθερή/Master Έκδοση",
  "encryption": "Kρυπτογράφηση",
  "encryption_1": "Το Phalcon παρέχει κρυπτογράφηση μέσω του στοιχείου Phalcon\\Crypt. Αυτή η τάξη προσφέρει απλά object-oriented περιτυλίγματα για την openssl βιβλιοθήκη κρυπτογράφησης του PHP.",
  "encryption_2": "Αυτό είναι ένα μυστικό κλειδί (32 bytes).",
  "encryption_3": "Αυτό είναι το κείμενο που θέλετε να κρυπτογραφήσετε.",
  "events": "Γεγονότα",
  "events_description": "Επεκτείνετε τα στοιχεία του πλαισίου με τη δημιουργία 'σημείων γάντζων'. Δημιουργήστε τις δικές σας εκδηλώσεις και να κάνετε την εφαρμογή σας πιο ευέλικτη και ισχυρή",
  "events_management": "Διαχείριση Γεγονότων",
  "events_management_1": "Ενας manager γεγονότων επιτρέπει να επισυνάψουμε ακροατές σε ένα συγκεκριμένο τύπο του γεγονότος. Ο τύπος που μας ενδιαφέρει τώρα είναι 'αποστολή'. Ο ακόλουθος κώδικας φιλτράρει όλα τα συμβάντα που παράγονται από τον Αποστολέα:",
  "events_management_2": "Δημιουργήστε ένα manager γεγονότων",
  "events_management_3": "Ακούστε τα γεγονότα που παράγονται στον αποστολέα χρησιμοποιώντας το plugin Ασφαλείας",
  "events_management_4": "Διαχειριστέιτε εξαιρέσεις και εχαιρέσεις τύπου δε-βρεθηκαν με το plugin NotFoundPlugin",
  "events_management_5": "Αντιστοιχείστε το manager γεγονότων στον αποστολέα",
  "facebook": "Facebook",
  "flash_messages": "Flash μηνύματα",
  "flash_messages_1": "Χρησιμοποιήστε τον κοινοποιητή flash να εμφανίσετε ειδοποιήσεις στους χρήστες σε μια εφαρμογή web:",
  "flash_messages_2": "υπήρχαν σφάλματα σε αυτή τη φόρμα",
  "flash_messages_3": "επιτυχία! ολα πήγαν μια χαρά",
  "flash_messages_4": "αυτή είναι μια παρατήρηση για τους χρήστες",
  "flash_messages_5": "αυτή είναι απλά μια προειδοποίηση",
  "flash_messages_description": "Τα μυνήματα Flash χρησιμοποιούνται για την ενημερώση του χρήστη σχετικά με την κατάσταση των δράσεων.",
  "forms_builder": "Δημιουργία Φόρμων",
  "forms_builder_1": "Κάθε στοιχείο με τη φόρμα μπορεί να αποδοθεί όπως απαιτείται από τον προγραμματιστή. Εσωτερικά, το Phalcon\\Tag χρησιμοποιείται για να παράγει το σωστό HTML για κάθε στοιχείο και μπορείτε να περάσετε τα επιπλέον χαρακτηριστικά HTML ως τη δεύτερη παράμετρο του render():",
  "forms_builder_2": "Αρχική σελίδα",
  "forms_builder_3": "Κινητό τηλέφωνο",
  "forms_builder_description": "Δημιουργήσετε εύκολα φόρμες HTML",
  "forum": "Φόρουμ",
  "gab": "Gab.ai",
  "get_phalcon": "Λήψη Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Η καινοτόμα αρχιτεκτονική του Phalcon, το κάνει το γρηγορότερο πλαίσιο PHP που κατασκευάστηκε ποτέ!",
  "header_tagline": "Ενα πλαίσιο PHP πλήρης στοίβας, που παρέχεται σαν επέκταση C",
  "high_performance_php_framework": "Πλάισιο PHP Υψηλής Απόδοσης",
  "hosting": "Φιλοξενεία",
  "hosting_amazon_ec2_1": "Το Amazon Elastic Compute Cloud προσφέρει επεκτάσιμη, pay-as-you-go υπολογιστική δυναμικότητα στο σύννεφο.",
  "hosting_amazon_ec2_2": "Επιλέξτε ένα προ-ρυθμισμένη, Image Machine Amazon (AMI) για να δμιουργηθεί και να λειτουργήσει άμεσα. Ή δημιουργήσετε ένα AMI που περιέχει τις εφαρμογές, βιβλιοθήκες, δεδομένα και τις συναφείς ρυθμίσεις που χρειάζεστε. <a href=':1:'>Δείτε περισσότερα</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "Το ASPnix παρέχει ανώτερες υπηρεσίες φιλοξενίας ιστοσελίδων σε Windows. Οι πελάτες μας έχουν βαθμολογίσει υπηρεσία μας ως εξαιρετική. Προσφέρουμε οικονομικά σχέδια για κοινόχρηστο Windows και Linux Ιστοφιλοξενία cPanel, εικονικού ιδιωτικού διακομιστές και αποκλειστικούς διακομιστές! <a href=':1:'>Δείτε περισσότερα</a>",
  "hosting_aspnix_2": "Το Phalcon υποστηρίζεται σε όλα τα Windows επιμερισμένα πακέτα και σχέδια φιλοξενείας, χωρίς να χρειάζεται ρύθμιση παραμέτρων ή περεταίρω εγκατάσταση! Προσφέρουν μια ποικιλία από εκδόσεις PHP 5.2-7.0, καθώς και πολλές <a href=':1:' target=\"_blank\">πρόσθετες επεκτάσεις</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "Το <a href=':1:'>Windows Azure cloud</a> σας παρέχει εξαιρετικά επεκτάσιμη και διαχειρίσιμη Windows φιλοξενία για τις εφαρμογές ιστού σας. Χρησιμοποιήστε το Phalcon για να μειώσετε το κόστος σας.",
  "hosting_azure_2": "Για να εγκαταστήσετε το Phalcon, ακολουθήσετε τις βήμα προς βήμα οδηγείες σε <a href=':1:'>αυτό το άρθρο του SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Το Phalcon μπορεί να εγκατασταθεί σε οποιοδήποτε υπολογιστή με την προυπόθεση ότι έχετε πρόσβαση SSH root (ή sudo). Παρακάτω θα βρείτε τη λίστα από ευυπόληπτες εταιρείες που προσφέρουν αυτές τις υπηρεσίες:",
  "hosting_digital_ocean_1": "Απίστευτα χρήγορη τεχνολογία Cloud. Χτισμένο για τους προγραμματιστές. Αναπτύξτε ένα SSD server στο cloud σε 55 δευτερόλεπτα. <a href=':1:'>Δείτε περισσότερα</a>",
  "hosting_digital_ocean_2": "Ακολουθήστε αυτό το <a href=':1:'>σεμινάριο</a> για να ξεκινήσετε",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_fortrabbit_1": "Το Fortrabbit προσφέρει πολλά πακέτα φιλοξενίας (υπάρχει ένα για τους προγραμματιστές και είναι δωρεάν - με ορισμένους περιορισμούς) που θα ικανοποιήσει τις ανάγκες των περισσότερων από τους προγραμματιστές που επιθυμούν είτε να δοκιμάσουν το Phalcon ή να αναπτύξουν τις εφαρμογές τους γραμμένες με αυτό.",
  "hosting_fortrabbit_2": "Προσφέρουν μια ποικιλία <a href=':1:'>επεκτάσεων</a> που θα ικανοποιήσει ακόμα και τον πιο απαιτητική εφαρμογή.",
  "hosting_fortrabbit_3": "Οι σταθερές εκδόσεις του Phalcon είναι προ-εγκατεστημένες, μπορείτε να τις ενεργοποιήσετε από το ταμπλό διοίκησης.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Εγκατασήστε το Phalcon χρησιμοποιώντας τις βασικές οδηγείες εγκατάστασης.",
  "hosting_kinghost_1": "Από το 2006, KingHost είναι μια από τις μεγαλυτερες εταιρείες χώρου φιλοξενίας  στη Βραζιλία και ήδη έχει πάνω από 300.000 ιστοσελίδες που φιλοξενούνται, με περίπου 60.000 πελάτες. Με έδρα στο Πόρτο Αλέγκρε (RS), και με κέντρα δεδομένων στη Βραζιλία, η εταιρεία προσφέρει την υπηρεσία φιλοξενίας κοινόχρηστους διακομιστές, συγκεκριμένα σχέδια για προσαρμοσμένους προγραμματιστές και έργα στον τομέα των επιχειρηματικών λύσεων, συμπεριλαμβανομένων των υπολογιστών και αφιερωμένους διακομιστές στο σύνεφο. Προσφέρει επίσης λύσεις ψηφιακού μάρκετινγκ, όπως λύσεις ηλεκτρονικού ταχυδρομείου μάρκετινγκ και ασφάλειας.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Επόμενης γενιάς, auto-μεγέθους PaaS για εφαρμογές Java, PHP, Ruby, Python και Node.js. Containers πλήρης απομόνωσης με αυτο-κλιμάκωση βάσει ρόλου για κάθε πελάτη, συμπεριλαμβανομένης της επιλογής του Apache ή Nginx, και πλήρες φάσμα του SQL και NoSQL διακομιστές. Πληρωμή μόνο για τη χρήση πόρων και όχι για το μέγεθος του διακομιστή. SSD-powered. Φιλοξενεία παρέχεται στο Ηνωμένο Βασίλειο.",
  "hosting_layershift_2": "Ακολουθήστε αυτό το <a href=':1:'>σεμινάριο</a> για να ξεκινήσετε",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Αναπτύξτε και διαχειριστείτε Linux Virtual Servers στο Linode Cloud. Δημιουργήστε ένα server σε δευτερόλεπτα με την επιλογή σας στη διανομή Linux, τους πόρους, και τη θέση του server στο δύκτιο μας. <a href=':1:'>Δείτε περισσότερα</a>",
  "hosting_linode_title": "Linode",
  "hosting_rackspace_1": "Οι Cloud Servers είναι εικονικές μηχανές που τρέχουν Linux ή Windows&reg; Server στο Rackspace Cloud. Μπορείτε να αλλάξετε κλιμακωτά τους πόρους, όπως CPU, μνήμη, και την αποθήκευση προς τα πάνω ή προς τα κάτω, ανάλογα με τις ανάγκες σας. Το καλύτερο από όλα είναι ότι μπορείτε να έχετε pay as you go. <a href=':1:'>Δείτε περισσότερα</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction φιλοξενεία για προγραμματιστές. Πλήρης πρόσβαση shell σε γρήγορους servers με όλα τα αγαπημένα σας εργαλεία προ-εγκατεστημένα και να διατηρούμενα για το χρήστη.",
  "hosting_webfaction_2": "Για να εγκαταστήσετε το Phalcon στο WebFaction, ακολουθήστε τις οδηγίες που περιγράφονται <a href=':1:'>εδώ</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Το στοιχείο Phalcon\\Translate βοηθά στη δημιουργία πολύγλωσσων εφαρμογών. Εφαρμογές που χρησιμοποιούν αυτό το στοιχείο, εμφανίζουν περιεχομένο σε διαφορετικές γλώσσες, βάσει της επιλεγμένης γλώσσας από το χρήστη, που υποστηρίζεται από την εφαρμογή.",
  "i18n_2": "Ρωτήστε τον browser ποια είναι η καλύτερη γλώσσα",
  "i18n_3": "Ελέγξτε αν έχουμε ένα αρχείο μετάφρασης για αυτή τη γλώσσα",
  "i18n_4": "Επιστροφή σε κάποια προκαθορισμένη λειτουργία",
  "i18n_5": "Επιστρέψτε ένα αντικείμενο μετάφρασης",
  "i18n_description": "Μεταφράστε τις εφαρμογές σας σε πολλαπλές γλώσσες εύκολα",
  "installing_phalcon_php": "Εγκατάσταση Phalcon PHP",
  "issue_tracker": "Ιχνηλάτης προβλημάτων",
  "join_our_community": "Ελάτε να συμμετάσχετε στην ζωντανή κοινότητά προγραμματιστών μας!",
  "join_our_community_description": "Συνεισφορές από την κοινώτητα με Επεκτάσεις, Plugins, Προσαρμογείς, VM, παραδείγματα, πηγαίος κώδικας... και περισσότερα",
  "language_text": "Ελληνικά",
  "learn": "Μάθετε",
  "license_new_bsd": "Το Phalcon είναι πλαίσιο PHP ανοικτού κώδικα <br /> χτισμένο σαν μια επέκταση C. Είναι διαθέσιμο υπό την <br /><a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'> Νέα BSD άδεια</a>.",
  "low_overhead": "Χαμηλή επιβάρυνση",
  "low_overhead_1": "Οι επεκτάσεις Zephir/C φορτώνονται με το PHP μια φορά μόνο, κατά τη διαδικασία εκκίνησης τού δαίμονα διακομιστή web",
  "low_overhead_2": "Κλάσεις και οι λειτουργίες που παρέχονται από την επέκταση είναι έτοιμες προς χρήση για οποιαδήποτε εφαρμογή",
  "low_overhead_3": "Ο κώδικας έχει μεταγλωττιστεί και δεν ερμηνεύεται, επειδή είναι ήδη μεταγλωτισμένο σε μια συγκεκριμένη πλατφόρμα και επεξεργαστή",
  "low_overhead_4": "Χάρη στη χαμηλού επιπέδου αρχιτεκτονική και βελτιστοποιήσεις το <strong>Phalcon παρέχει τη χαμηλότερη επιβάρυνση για εφαρμογές που βασίζονται στο MVC</strong>",
  "low_overhead_description": "Χαμηλή κατανάλωση μνήμης και CPU σε σύγκριση με παραδισιακές στοίβες",
  "low_overhead_title": "PHP C-επέκταση (Phalcon)",
  "more": "ΠΕΡΙΣΣΟΤΕΡΑ...",
  "mvc": "MVC",
  "mvc_1": "Δημιουργήστε ενιαίες και πολυ-λειτουργικές εφαρμογές με ευκολία και ευχαρίστηση. Χρησιμοποιώντας το σχέδιο αρχείων δομής και μοτίβες που ήδη γνωρίζετε.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Λειτουργικές μονάδες, συστατικά, μοντέλα, απόψεις και ελεγκτές",
  "odm_for_mongo": "ODM για Mongo",
  "odm_for_mongo_1": "Επιπρόσθετα στην ικανότητά καταγραφής πινάκων σε σχεσιακές βάσεις δεδομένων, το Phalcon μπορεί να αντιστοιχίσετε έγγραφα σε μια βάση δεδομένων του MongoDB. Το ODM προσφέρει λειτουργίες CRUD , εκδηλώσεις, επικυρώσεις μεταξύ άλλων υπηρεσιών.",
  "odm_for_mongo_2": "Πόσα ρομπότς υπάρχουν;",
  "odm_for_mongo_3": "Πόσα μηχανικά ρομπότς υπάρχουν;",
  "odm_for_mongo_4": "Βρέθηκαν :1: ρομπότς",
  "odm_for_mongo_description": "Αντικείμενο Αντιστοίχισης Εγγράφων για MongoDB",
  "oops": "Houston έχουμε ένα πρόβλημα!",
  "or": "ή",
  "orm": "ORM",
  "orm_1": "Ένα ισχυρό ORM παρέχεται από το Phalcon που σας επιτρέπει να χειριστείτε αρχεία βάσεων δεδομένων ως κλάσεις και αντικείμενα. MySQL, PostgreSQL και SQLite υποστηρίζονται αυτόματα από το Phalcon.",
  "orm_description": "Αντικείμενο Σχεσιακής Χαρτογράφησης",
  "phalcon_team": "Η ομάδα του Phalcon",
  "phalcon_team_1": "Πολλοί περισσότεροι εθελοντές",
  "phalcon_team_2": "Το Phalcon είναι και ήταν πάντα μια προσπάθεια πολλών εθελοντών:",
  "phql": "PHQL",
  "phql_1": "Το PHQL είναι μια object-oriented διάλεκτος SQL υψηλού επιπέδου, που σας επιτρέπει να γράψετε ερωτήματα χρησιμοποιώντας μια τυποποιημένη γλώσσα SQL. Το PHQL υλοποιείται ως ένα πρόγραμμα ανάλυσης (γραμμένο σε C) που μεταφράζεται στη σύνταξη του στόχου RDBMS. Για να επιτύχετε την υψηλότερη δυνατή απόδοση, το Phalcon παρέχει ένα πρόγραμμα ανάλυσης που χρησιμοποιεί την ίδια τεχνολογία όπως το SQLite. Η τεχνολογία αυτή παρέχει ένα μικρό πρόγραμμα ανάλυσης στη μνήμη που ξοδεύει πολυ λίγη μνήμη και προσφέρει ασφάλεια για νήματα επεξεργασίας.",
  "phql_2": "Ονομα",
  "phql_description": "Η ισχυρή και ασφαλή Phalcon Query Language, PHQL",
  "polling_app": "Μια εφαρμογή δημοσκοπήσεων που χτίστηκε από το μηδέν σε < 15 λεπτά",
  "queueing": "Υπηρεσίες Ουράς - διαδικασίες στο παρασκήνιο",
  "queueing_1": "Δραστηριότητες όπως η επεξεργασία βίντεο, αλλαγή μεγέθους των εικόνων ή αποστολή μηνυμάτων ηλεκτρονικού ταχυδρομείου δεν είναι κατάλληλες για να εκτελεστούν σε απευθείας σύνδεση ή σε πραγματικό χρόνο, επειδή επιβραδύνουν το χρόνο φόρτωσης των σελίδων και συνεπώς να επηρεάσουν σοβαρά την εμπειρία του χρήστη. Η καλύτερη λύση εδώ είναι η εφαρμογή θέσεις εργασίας στο φόντο. Η ιστοσελίδα τοποθετεί εργασίες σε μια ουρά και που θα υποβληθούν για επεξεργασία ξεχωριστά από την κύρια ιστοσελίδα.",
  "queueing_2": "Σύνδεση με την ουρά",
  "queueing_3": "Εισαγωγή της εργασίας στην ουρά",
  "queueing_description": "Χρησιμοποιήστε το ενσωματωμένο σύστημα ουρών στο Phalcon για να προγραμματίσετε εργασίες και να μειώσετε το φόρτο του διακομιστή σας",
  "resources": "Πόροι",
  "rest": "Rest",
  "rest_description": "Στην περίπτωση αυτή, μπορείτε να χρησιμοποιήσετε είτε μια εφαρμογή micro ή πλήρης στοίβας για να πετύχετε τον στόχο σας. Επιπλέον, ένα ισχυρό σετ βοηθών HTTP.",
  "restful_services": "Υπηρεσιες REST",
  "restful_services_1": "Γράψιμο υπόλοιπο διακομιστών και εφαρμογών δεν ήταν ποτέ ευκολότερο. Κανένα στερεότυπο. Απλές υπηρεσίες που χωρούνε σε ένα αρχείο.",
  "restful_services_2": "Επιστρέφοντας δεδομένα σε μορφή JSON",
  "roadmap": "Χάρτης πορείας",
  "router": "Δρομολογητής",
  "router_1": "Δρομολόγηση δεδομένου όπως πρέπει. Τίποτα περισσότερο. Τίποτα λιγότερο.",
  "router_2": "Δημιουργήστε το διαδρομέα",
  "router_3": "Καθορίσετε μια διαδρομή",
  "router_description": "Το Phalcon\\Mvc\\Router παρέχει προηγμένες δυνατότητες δρομολόγησης.",
  "sample_applications": "Δείγματα Εφαρμογών",
  "see_for_yourself": "Δείτε το και μόνοι σας...",
  "sharding": "Sharding",
  "sharding_1": "Επισυνάψετε μοντέλα σε διαφορετικές βάσεις δεδομένων",
  "sharding_2": "Αυτή η υπηρεσία επιστρέφςι μια βάση δεδομένων MySQL",
  "sharding_3": "Αυτή η υπηρεσία επιστρέφςι μια βάση δεδομένων PostgreSQL",
  "sharding_description": "Συνδεθείτε, αποθηκεύστε και ανακτήστε δεδομένα από πολλές βάσεις δεδομένων ταυτόχρονα",
  "slack": "Slack",
  "something_went_wrong": "Κάτι πήγε στραβα :(",
  "sponsored_by": "Υποστηρίζεται από",
  "sponsors": "Σπόνσορες",
  "sponsors_and_supporters": "Σπόνσορες και Υποστηρηκτές",
  "sponsors_and_supporters_upper": "ΔΩΡΗΤΕΣ ΚΑΙ ΥΠΟΣΤΗΡΗΚΤΕΣ",
  "sponsors_become_patron": "Γίνετε Σπόνσορας!!",
  "sponsors_description_1": "Για εκείνους που επιθυμούν να υποστηρίξουν το έργο μας και την περαιτέρω ανάπτυξη του Phalcon, προσφέρουμε διάφορες επιλογές χορηγίας που θα ταιριάζουν σε οποιοδήποτε πορτοφόλι. Υποστηρήζωντας τη δουλειά μας, μας επιτρέπει να αφιερώσουμε περισσότερο χρόνο στο Phalcon, να προσφέρουμε ταχύτερες λύσεις σε bugs και δημιουργία καινούργιων λειτουργειών, και διασφαλίζουν τη σταθερότητα του Phalcon.",
  "sponsors_our_great_sponsors": "Αυτοί είναι οι σπόνσορες μας! Σας ευχαριστούμε!!",
  "stack_overflow": "Stack Overflow",
  "store": "Μαγαζί",
  "support": "Υποστήρηξη",
  "support_documentation_1": "Παρακαλούμε χρησιμοποιήστε την :1: πριν από οτιδήποτε άλλο. Μπορείτε επίσης να χρησιμοποιήσετε τη δυνατότητα αναζήτησης στα τεκμήριά μας για να βρείτε αυτό που ψάχνετε. Εάν η ερώτησή σας δεν έχει ακόμα απαντηθεί, υπάρχουν περισσότερες επιλογές παρακάτω.",
  "support_download_page": "σελίδα λήψης",
  "support_forum_1": "Μπορείτε να ρωτήσετε ερωτήσεις σας στο <a href=':1:'>Φόρουμ</a> μας",
  "support_note": "Πολλά bugs αναφέρονται επειδή οι χρήστες δε χρησιμοπουούν την τελευταία έκδοση. Παρακαλούμε επισκεφθείτε το :1:, κατεβάστε την τελευταία διαθέσιμη έκδοση (ή ξαναδημιουργηστε το με τον πηγαίο κώδικα) και επιβεβαιώστε εάν το θέμα που αντιμετωπίζετε είναι πράγματι ένα bug.",
  "support_phalcon_forum": "Phalcon Φόρυμ",
  "support_please_note": "Παρακαλούμε σημειώστε:",
  "support_please_note_1": "Το Stack Overflow δεν είναι αφιερωμένο στην υποστήριξη του Phalcon",
  "support_please_note_2": "Παρακαλούμε μην αναφέρετε bugs εκεί. Χρησιμοποιήστε για αυτό την <a href=':1:'>αναφορά προβλημάτων</a> στο Github",
  "support_please_note_3": "Παρακαλούμε μη ζητάτε καινούργια λειτουργικότητα εκεί. Χρησιμοποιήστε για αυτό την <a href=':1:'>αναφορά προβλημάτων</a> στο Github",
  "support_please_note_4": "Σιγουρευτήτε ότι έχετε την ετικέτα 'phalcon' με την ερώτηση σας",
  "support_please_note_5": "Σιγουρευτήτε ότι αναφέρετε το 'Phalcon' στην ερώτησή σας",
  "support_reporting_a_bug": "Αναφορά bug",
  "support_reporting_a_bug_1": "Παρακαλούμε αναφέρετε bugs όταν έχετε εξαντλήσει όλες τις παραπάνω επιλογές, χρησιμοποιώντας την <a href=':1:'>αναφορά προβλημάτων</a> στο Github.",
  "support_slack": "Slack",
  "support_slack_1": "Μπορείτε να μας βρήτε στο κανάλι <a href=':1:'>PhalconChats</a> στο Slack.",
  "support_stack_overflow_1": "Εάν είστε εξοικειωμένοι ή προτιμάτε το Stack Overflow, υπάρχει μία <a href=':1:'>phalcon</a> ετικέτα που μπορείτε να χρησιμοποιήσετε για αναζητήση ή να σημαδέψετε το ερώτημά σας.",
  "support_us": "Υποστηρήξτε μας",
  "team": "Ομάδα",
  "team_andres_1": "Ο Andres γνωρίζει πάρα πολύ καλά τις εφαρμογές ανοικτού κώδικα. Κατά τα τελευταία εννέα χρόνια, έχει σχεδιάσει και κυκλοφορήσει frameworks για PHP και έχει συμμετάσχει στην ανάπτυξη ιστοσελίδων και εφαρμογών Ιστού - το κύριο πάθος του.",
  "team_andres_2": "Νικητής του διαγωνισμού TR35, ο Andres έχει ένα κύριο σκοπό, να διαλέγει, αναπτύσει ή να χρησιμοποιήσει το κατάλληλο εργαλείο για την κατάλληλη δουλειά. Γιαυτό, το 2011 είχε μια καινούργια ιδεα: να δημιουργήσει ένα νέο είδος framework για προγραμματιστές PHP, το οποίο που εστιάζει στην χρηστικότητα, χαρακτηριστικά, και κυρίως την απόδοση.",
  "team_andres_3": "Μέσα από αυτή τη νέα καινοτόμο προσέγγιση γεννήθηκε το Phalcon. Ένα PHP framework γραμμένο σε γλώσσα C, που μπορεί να προσφέρει μια πληθώρα δυνατοτήτων για τους προγραμματιστές, ενώ ταυτόχρονα μεγιστοποιοεί την απόδοση των εφαρμογών και διατηρεί την χρησιμοποίηση πόρων σε χαμηλά επίπεδα.",
  "team_andres_4": "Ο Andres είναι ένας από τους κύριους προγραμματιστές του Phalcon και αυτός που το εμπνεύστηκε.",
  "team_eduar_1": "O Eduar είναι έναs C/PHP προγραμματιστής με πολλά χρόνια εμπειρίας στην ανάπτυξη εφαρμογών. Είναι ένας από τους ιδρυτές και δημιουργούς του Phalcon που ξεκίνησε το 2011.",
  "team_eduar_2": "Έχει λάβει μέρος σε όλους τους τομείς, από το σχεδιασμό πλαισίου έως τον εσωτερικό πυρήνα λειτουργιών, συμπεριλαμβανομένης της τεκμηρίωσης και των εργαλείων προγραμματιστή. Οδηγείται από μια γοητεία με τα πλαίσια, γλωσσών και νέες τεχνολογίες.",
  "team_eduar_3": "Του αρέσουν ταινίες επιστημονικής φαντασίας και μερικές φορές παίζει ποδόσφαιρο.",
  "team_nikolay_1": "Ο Nikolay έχει πάνω από 10 χρόνια πείρα στην ανάπτυξη εφαρμογών ιστού. Έχει συμμετάσχει σε εφαρμογές υψηλής απόδοσης, καθώς και πολύπλοκες, και σε πολύπλοκους σχεδιασμούς ιστοσελίδων.",
  "team_nikolay_2": "Ο Nikolay έχει ασχοληθεί με έργα Open Source για ένα μεγάλο χρονικό διάστημα, αξιοποιώντας τους όποτε απαιτήσεις επιτρέπουν. Άρχισε να προσφέρες τον προσωπικό χρόνο του για να δώσει πίσω στην κοινότητα ανοιχτού λογισμικου, με διακλάδωσεις εφαρμογών, προσφέροντας αρχιτεκτονικές αλλαγές και προτάσεις, καθώς και αλλαγες επιδόσεων. Έχει συμβάλει στη βελτίωση Open Source CMS εφαρμογών λαμβάνωντας θετικά σχόλια από την κοινότητα.",
  "team_nikolay_3": "Η συνεχής ενασχόλησή του με εφαρμογές ανοικτού κώδικα, τον έχει βοήθησε να προωθήσει τις τεχνικές του γνώσεις, ενώ ταυτόχρονα δίνει πίσω στην κοινότητας με τον χρόνο του.",
  "team_nikolay_4": "Ο Nikolay είναι ένας φανατικός υποστηρικτής της μεγιστοποίησης απόδοσης σε εφαρμογές ιστού. Μετά την εισαγωγή του στην ομάδα Phalcon, αποφάσισε να συνεχίσει και να χρησιμοποιήσει το framework και να γίνει ένας ευαγγελιστής για αυτό. Οδηγεί την προσπάθεια για τη Ρωσική κοινότητα και προσφέρει πόρους για Ρωσόφωνους προγραμματιστές.",
  "team_nikolay_5": "Οι συνεισφορές του περιλαμβάνουν: Ενας καθρέφτης της κυριας ιστοσελίδας μας στα Ρώσικα (<a href=':1:'>http://www.phalcon.ru</a>), ένα καθρέφτη της ιστοσελίδας τεκμηρίωσης στα Ρώσικα (<a href=':2:'>http://docs.phalconphp.ru</a>), συνεχείς αλλαγές και διορθώσεις στην τεκμηρίωση στα Αγγλικά, μια ομάδα στο κοινωνικό δίκτυο Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Ο Νίκος δουλεύει στον κλάδο του ΙΤ για πάνω από 20 χρόνια. Εισάχθηκε στον κόσμο του PHP το 2000 και έχει το χρησιμοποιεί από τότε σε προσωπικά έργα, καθώς και έργα για τους εργοδότες του.",
  "team_nikos_2": "Αγαπά την ανακάλυψη νέων τεχνολογιών και τρόπους για να τους ενσωματώσει με τις υπάρχουσες εφαρμογές και συνεπώς, να καρπωθούν με τα οφέλη που προσφέρουν.",
  "team_nikos_3": "Είναι ένας φανατικός υποστηρικτής του Test Driven Development (TDD) και προσπαθεί πάντα να έχει πλήρη κάλυψη στον κώδικά του.",
  "team_nikos_4": "Το συνεχές ενδιαφέρον του Νίκου σε νέες και καινοτόμες τεχνολογίες αποκλίνωντας από τους κανόνες τον φέρανε στον Phalcon. Εντάχθηκε στην ομάδα και τα καθήκοντά του αφορούν κυρίως το συντονισμό των NFRs και bugs, βοήθεια με τέστς, τεκμηρίωση και το incubator. Ο Νίκος είναι επίσης υπεύθυνος για τη δημιουργία των Windows DLLs για το Phalcon και να προσφέρει υποστήριξη όποτε είναι δυνατόν.",
  "team_serghei_1": "Ο Serghei έχει εργαστεί ως προγραμματιστής Ruby/PHP για πάνω από 8 χρόνια και έχει ειδικευτεί στην ανάπτυξη εφαρμογών ιστού.. Είναι φανατικός υποστηρικτής και υπέρμαχος της Ανάπτυξης με Γνώμονα Συμπεριφοράς (BDD) και είναι μέλος της ομάδας <a href=':1:'>Codeception</a>.",
  "team_serghei_2": "Ο Serghei έχει πάθος με καινοτόμες τεχνολογίες, και έτσι βρήκε το Phalcon. Ο ρόλος του είναι να συντονίζει NFRs και bugs, τεστς, τα εργαλεία για προγραμματιστές (developer tools), incubator και υποστήρηξη για άλλες εφαρμογές που έχουν δημιουργηθεί με το Phalcon.",
  "team_serghei_3": "Όταν δεν εργάζεται, ο Serghei απολαμβάνει ντοκιμαντέρ, ταινίες επιστημονικής φαντασίας και παίζει μερικές φορές Mahjong ή Go.",
  "template_engine_volt": "Μηχανή Προτύπων (Volt)",
  "template_engine_volt_1": "Το Volt είναι μια εξαιρετικά γρήγορη και φιλική για τους σχεδιαστές templating γλώσσα γραμμένο σε Zephir/C για PHP. Σας παρέχει ένα σύνολο των βοηθών να γράφετε απόψεις εύκολα. Το Volt είναι ενσωματωμένη με άλλα στοιχεία του Phalcon, και μπορείτε να το χρησιμοποιήσετε ως ένα αυτόνομο στοιχείο στις εφαρμογές σας.",
  "template_engine_volt_description": "Ενα πρότυπο κινητήρα απόψεων, εμπνευσμένο από τη Jinja αλλά χτισμένο σε C για το PHP",
  "template_engines": "Κινητήρας Πρότυπων",
  "template_engines_1": "Απόψεις είναι τα στοιχεία που αντιπροσωπεύουν το περιβάλλον εργασίας του χρήστη της εφαρμογής σας. Απόψεις είναι συχνά αρχεία HTML με ενσωματωμένο PHP κώδικα που εκτελούν εργασίες οι οποίες σχετίζονται αποκλειστικά με την παρουσίαση των δεδομένων. Οι απόψεις χειρίζονται την εργασία της παροχής των δεδομένων για το πρόγραμμα περιήγησης ή άλλο εργαλείο που χρησιμοποιείται για να κάνουν αιτήσεις από την εφαρμογή σας.",
  "template_engines_description": "Απόψεις είναι τα στοιχεία που αντιπροσωπεύουν το περιβάλλον εργασίας του χρήστη της εφαρμογής σας.",
  "testimonials": "Πιστοποιήσεις",
  "testimonials_1": "Γειά σας ομάδα του Phalcon! Έχω ένα project, που δημιουργήθηκε με το Phalcon framework. Το όνομα του είναι Guitarama (<a href=':1:'>:2:</a>) - ένας κατάλογος για κιθάρες και χορδές. Η ιστοσελίδα έχει δημιουργηθεί για το κοινό της Ρωσίας, αλλα ελπίζω ότι δεν θα υπάρχουν προβλήματα κατανόησης του περιεχομένου των σελιδών του. Η ιστοσελίδα ξανα δημιουργήθηκε σε μια καινούργια πλατφόρμα την αρχή του Ιανουαρίου 2013, και από τότε έχει σταθερά μεγαλώσει σε επισκέψεις. Καθημερινές επισκέψεις: 1500 μοναδικούς επισκέπτες, ~ 5000 προβολές σελίδων. Η ιστοσελίδα λειτουργεί σε ένα παλιό server 1хP4-3GHz, 4GB RAM. Για άλλη μια φορά, σας ευχαριστώ για το φανταστικό framework και για όλη τη δουλειά σας :) Michael.",
  "testimonials_2": "Γεια σας, ομάδα Phalcon. Θα ήθελα να μοιραστώ μαζί σας την ιστορία επιτυχίας μας για τη χρήση Phalcon στο <a href=':1:'>:2:</a> και <a href=':3:'>:4:</a>, τις πιό δημοφιλής ιστοσελίδες, σύμφωνα με τους TOP-10 κατατασσόμενους στο CIS. Και οι δύο ιστοσελίδες χρησιμοποιούν ένα RESTful API προγραμματισμένο με το Phalcon\\Mvc\\Micro. Σε στιγμές αιχμής το API μας επεξεργάζεται περίπου 400 απαιτήσεις / δευτερόλεπτο και δεν είναι το όριο της εφαρμογής μας. Χρησιμοποιώνας το Phalcon μας επέτρεψε να μειώσουμε το χρόνος απόκρισης της εφαρμογής, της κατανάλωσης CPU και μνήμης RAM, καθώς και να μείωση του χρόνου της διαδικασίας ανάπτυξης. Θα συνεχίσουμε να χρησιμοποιούμε το Phalcon για τις καινούργιες μας εφαρμογές. Σας ευχαριστώ για την εξαιρετική δουλειά που κάνετε! Με φιλικούς χαιρετισμούς, Nikita Vershinin, Lead Developer, Kolesa.kz και krisha.kz",
  "testimonials_3": "Ομάδα Phalcon, το framework που έχετε δημιουργήσει είναι καταπληκτικό. Δεν έχω ποτέ χρησιμοποιήσει ένα τέτοιο framework συνδυάζει ταχύτητα, αποτελεσματικότητα, συντομία και  φυσικότητας όλα σε ένα πακέτο. Σκοπεύω να προασπίσω το Phalcon και να συμβάλλω με οποιοδήποτε τρόπο που μπορώ. Ξεκίνησα πρόσφατα ένα ~ 800-ωρο έργο και είμαι ευτυχής να δηλώσω ότι χρησιμοποιούμε το Phalcon framework. Μπράβο. Brian Seymour",
  "testimonials_4": "Γεια σας παιδιά, ανακάλυψα το Phalcon και είναι απλά φοβερό! Ήθελα μόνο να πω πόσο φοβεροί είστε! Οπότε, σας ευχαριστώ γι 'αυτό το framework και να διατηρήστε την καλή δουλειά! Ivan Penchev",
  "testimonials_5": "Γειά σας παιδειά, δημιούργησα μιά απλή υπηρεσία url-shortener με το phalcon. Ήταν εκπληκτικό! <a href=':1:'>:2:</a>. Demo είναι εδώ <a href=':3:'>:4:</a> :) Murat Küçükosman",
  "testimonials_6": "Γειά σας ομάδα Phalcon. Εχω δημιουργήσει μια μικρή εφαρμογή που έχει σχεδιαστεί για Πολωνούς χρήστες και χρησιμοποιώντας το Phalcon. Οφείλω να ομολογήσω ότι η απόδοση είναι καταπληκτική, συγχαρητήρια καλή δουλειά. Η εφαρμογή είναι μια υπηρεσία για την επικύρωση του περιεχομένου των ιστοσελίδων στα Πολωνέζικα  <a href=':1:'>:2:</a>",
  "testimonials_7": "Γεια σας παιδιά! Απλά ήθελα να μοιραστώ μαζί σας την τελευταία έκδοση μιας παλιάς εφαρμογής μας - <a href=':1:'>:2:</ a>. Η μετατροπή της εφαρμογής σε Phalcon μας επέτρεψε να μειώσουμε στο μισό το  φόρτο του διακομιστή σε σύγκριση με την προηγούμενη έκδοση της εφαρμογής, που είναι φανταστικό!",
  "testimonials_description": "Παρακάτω είναι μια συλλογή από μαρτυρίες και ιστορίες επιτυχίας, από εσάς, τους προγραμματιστές και τους χρήστες του Phalcon PHP. Μας χαροποιούν πάντα τα μηνύματα με τις ιστορίες επιτυχίας σας και θα τα δημοσιεύουμε στο blog μας. Εάν επιθυμείτε να μας στείλετε την ιστορία επιτυχίας σας ή να έρθετε σε επαφή μαζί μας, μη διστάσετε να μας στείλετε mail στο <a href='mailto::1:'>:2:</a>.",
  "toggle_navigation": "Εναλλαγή πλοήγησης",
  "transactions": "Συναλλαγές",
  "transactions_1": "Όταν μια διεργασία εκτελεί πολλές λειτουργίες στη βάση δεδομένων, θα μπορούσε να είναι σημαντικό ότι κάθε βήμα έχει ολοκληρωθεί με επιτυχία, έτσι ώστε να μπορεί να διατηρηθεί η ακεραιότητα των δεδομένων. Οι συναλλαγές προσφέρουν την ικανότητα να διασφαλίσετε ότι όλες τις λειτουργίες της βάσης δεδομένων έχουν εκτελεστεί με επιτυχία πριν τα δεδομένα καταχωρηθούν στη βάση δεδομένων.",
  "transactions_2": "Δημιουργήσετε ένα manager συναλλαγών",
  "transactions_3": "Ζητήστε μια συναλλαγή",
  "transactions_4": "Λάβετς τα ρομπότς που θα διαγραφούν",
  "transactions_5": "Κάτι πήγε στραβά, πρέπει να επαναφέρουμε τη συναλλαγή",
  "transactions_6": "Ολα είνα εντάξει. Ας καταχωρήσουμε τη συναλλαγή",
  "transactions_7": "Τα ρομπότς διαγραφήκανε με επιτυχία!",
  "transactions_8": "Αποτυχία, λόγος: ",
  "transactions_description": "Οι συναλλαγές στο Phalcon σας δλινουν τη δυνατότητα να διατηρήσετε την ακεραιότητα των δεδομένων σας ασφαλή.",
  "try_phalcon": "Δοκιμάστε το Phalcon",
  "tutorial": "Εκπαιδευτικό",
  "twitter": "Twitter",
  "views_and_frontend": "Απόψεις και frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Παρακολουθήστε το βίντεο επίδειξης",
  "zephir": "Zephir"
}
